[{"id":"6980aee903a41c373981f98f","agentId":null,"customerName":"Business Trip to China from India (July 2026)","customerEmail":null,"source":"India","destination":"China","steps":[{"id":"step-160256037180082-0","name":"Flight Booking","description":"Secure round-trip flights from a major Indian city (e.g., Delhi, Mumbai) to a major Chinese city (e.g., Beijing, Shanghai) with a reputable airline like Air China, China Eastern, or potentially Emirates/Qatar Airways for connections. Explore options for premium economy or business class within the budget.","status":"PENDING","metadata":{},"warning":"Flights from India to China require a mandatory 5-day quarantine upon arrival. This step initiates travel from India to China which violates the advisory.","alternative":"Postpone travel until the mandatory quarantine is lifted or explore alternative business destinations without active travel advisories. If travel to China is essential, factor in a 5-day quarantine period when scheduling the trip.","completed":false},{"id":"step-160256043945541-1","name":"Visa Application","description":"Initiate the Chinese business visa application process well in advance. Gather necessary documents (passport, invitation letter, company letter, etc.) and schedule an appointment at the Chinese embassy/consulate in India. Consider using a visa service to expedite the process.","status":"PENDING","metadata":{},"warning":"Initiating a Chinese business visa application for travel from India to China violates the advisory, as travel requires a mandatory 5-day quarantine.","alternative":"Postpone the visa application until the quarantine requirement is lifted or explore business opportunities in countries without travel restrictions. If the trip remains essential, the visa application can proceed, keeping in mind the 5-day quarantine requirement to avoid visa expiration issues.","completed":false},{"id":"step-160256043951749-2","name":"Accommodation Booking","description":"Reserve a 4- or 5-star hotel in the chosen Chinese city. Options include brands like Shangri-La, Hyatt, or Hilton. Look for hotels with business centers, reliable Wi-Fi, and convenient access to meeting locations. Aim for approximately $150-$250 per night.","status":"PENDING","metadata":{},"warning":"Booking a standard hotel in China is not compliant with the advisory. The traveler will be subject to a 5-day mandatory quarantine upon arrival from India.","alternative":"Ensure the hotel booking is specifically for a designated quarantine hotel approved by the Chinese authorities. Confirm the hotel accepts international travelers under quarantine conditions.","completed":false},{"id":"step-160256043954499-3","name":"Airport Transfers","description":"Arrange for private airport transfers to and from the hotel using a reputable service. Pre-booking guarantees a smooth and reliable arrival and departure experience, minimizing potential delays and language barriers. Consider options like Blacklane or local chauffeur services.","status":"PENDING","metadata":{},"warning":"Airport transfers in China immediately follow arrival from India, and thus are subject to the mandatory 5-day quarantine.","alternative":"Arrange for airport transfer that goes directly to the designated quarantine hotel. Coordinate this with the local authorities beforehand to ensure compliance with quarantine procedures.","completed":false},{"id":"step-160256043956874-4","name":"Business Meeting Arrangements","description":"Coordinate meeting schedules and locations. Consider renting meeting rooms at the hotel or at a dedicated business center, ensuring necessary equipment (projector, screen, Wi-Fi) is available. Arrange for translation services if needed.","status":"PENDING","metadata":{},"warning":"Arranging business meetings immediately after arrival in China violates the mandatory 5-day quarantine requirement for travelers from India.","alternative":"Reschedule meetings to take place after the mandatory 5-day quarantine period is completed. Consider virtual meetings during the quarantine period.","completed":false},{"id":"step-160256043959332-5","name":"Cultural Immersion & Networking","description":"Plan for evening activities to foster relationships. Consider a traditional Chinese dinner at a well-regarded restaurant or tickets to a cultural performance (e.g., Peking Opera, Kung Fu show). This allows for informal networking opportunities.","status":"PENDING","metadata":{},"warning":"Planning cultural immersion and networking activities immediately after arrival in China violates the mandatory 5-day quarantine requirement for travelers from India.","alternative":"Postpone any in-person social activities until after the 5-day quarantine period. Consider virtual networking opportunities during the quarantine period.","completed":false},{"id":"step-160256043961457-6","name":"Travel Insurance","description":"Purchase comprehensive travel insurance that covers medical emergencies, trip cancellations, and lost belongings. Ensure the policy is valid for China and includes coverage for business activities. Consider providers like Allianz or World Nomads.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"step-160256043963624-7","name":"Local Transportation","description":"Familiarize yourself with the local transportation options, such as the subway system, taxis, and ride-sharing apps (if available and reliable in the chosen city). Download relevant apps (e.g., Didi) for ease of use. Consider hiring a local interpreter/guide for assistance with navigation and communication.","status":"PENDING","metadata":{},"warning":"Using local transportation in China immediately after arrival from India violates the mandatory 5-day quarantine requirement for travelers from India.","alternative":"Transportation should be limited to transfers directly to and from the designated quarantine location, as approved by the local authorities. Avoid all other forms of local transport until the quarantine is complete.","completed":false},{"id":"step-160256043965749-8","name":"Currency Exchange & Spending Money","description":"Exchange Indian Rupees to Chinese Yuan before departure or upon arrival at the airport. Inform your bank about your travel dates to avoid card blocking. Budget for meals, transportation, incidentals, and potential souvenirs.","status":"PENDING","metadata":{},"warning":"Exchanging currency for spending money in China from India violates the mandatory 5-day quarantine advisory for travelers from India to China, assuming this would occur before completing quarantine.","alternative":"Exchange only essential currency for immediate needs upon arrival and avoid unnecessary movement until after completing the 5-day quarantine.","completed":false}],"travelDate":"2026-07-01","finished":false},{"id":"11aabe37-3fbf-41e8-9d83-2bbb527d1274","agentId":null,"customerName":"Business Trip to China from India (July 2026) (Advisory Review)","customerEmail":null,"source":"India","destination":"China","steps":[{"id":"advisory-guidance-160345809263082","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: Variable - depends on rescheduling or rerouting. Cancellation fees could range from $50 - $500. Rerouting could increase fares by $500 - $2000+., Delay: 5 days (quarantine period)","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Your Name] calling from [Travel Agency]. I'm calling regarding your upcoming business trip to China on July 1st, 2026. A new travel advisory has just been issued for travel from India to China, and I need to make you aware of it urgently.\n\nThe advisory is classified as HIGH severity. It mandates a mandatory 5-day quarantine upon arrival in China for all travelers coming from India. This means that you will be required to quarantine in a designated facility for five days before you can proceed with your business activities.\n\nI understand this is likely disruptive to your plans. This quarantine requirement will impact your schedule and could also incur additional expenses, such as potential cancellation fees for pre-booked activities or accommodation beyond the quarantine period. There could also be costs associated with the quarantine facility itself. We are working to understand if these costs are borne by the traveler or the destination country but will update you as soon as possible.\n\nDepending on the flexibility of your business meetings, one option could be to postpone your trip. Moving the travel date by at least 5 days *after* the quarantine period would allow you to fulfill your business obligations as originally planned. I can explore alternative dates in July or later and provide you with the cost differences.\n\nAlternatively, if rescheduling is not possible, we can explore rerouting your trip, if feasible for your business needs, to a country without a mandatory quarantine. However, this option will likely result in significantly higher airfares and may require additional visa arrangements, depending on the new destination.\n\nPlease let me know your immediate thoughts and if you have any flexibility with your dates. I will begin researching alternative flight options and associated costs based on your preferred course of action. Time is of the essence due to potential flight availability and fare fluctuations. What are your thoughts?","advisoryId":"6980af3d03a41c373981f990","estimatedTimeDelay":"5 days (quarantine period)","estimatedCost":"Variable - depends on rescheduling or rerouting. Cancellation fees could range from $50 - $500. Rerouting could increase fares by $500 - $2000+.","isAdvisoryTask":true},"warning":"This step acknowledges the impact of the China travel advisory which enforces a 5-day quarantine period from India to China. The delay specified in the description is congruent with this advisory.","alternative":"No alternative is required as this step acknowledges the travel advisory.","completed":false},{"id":"527f3913-067a-43fd-acd0-4af1a4d91e35","name":"Flight Booking","description":"Secure round-trip flights from a major Indian city (e.g., Delhi, Mumbai) to a major Chinese city (e.g., Beijing, Shanghai) with a reputable airline like Air China, China Eastern, or potentially Emirates/Qatar Airways for connections. Explore options for premium economy or business class within the budget.","status":"PENDING","metadata":{},"warning":"This step involves booking a flight from India (e.g., Delhi, Mumbai) to China (e.g., Beijing, Shanghai). The active advisory mandates a 5-day quarantine upon arrival in China from India.","alternative":"Consider delaying the flight booking until the advisory is lifted. Alternatively, factor in the 5-day quarantine period when planning the trip and booking accommodation and meetings.","completed":false},{"id":"3ac8e55d-f19f-404c-a866-5c0ca1421777","name":"Visa Application","description":"Initiate the Chinese business visa application process well in advance. Gather necessary documents (passport, invitation letter, company letter, etc.) and schedule an appointment at the Chinese embassy/consulate in India. Consider using a visa service to expedite the process.","status":"PENDING","metadata":{},"warning":"The Business Visa application should factor in the quarantine period in China for at least 5 days, which may impact the validity and duration of the visa.","alternative":"When initiating the Chinese business visa application process, accurately reflect the expected entry date, which is the date of arrival plus 5 quarantine days and adjust accordingly for the invitation letter and other documents.","completed":false},{"id":"1dcfe200-de2e-4e66-a6cb-44a32cfbe9e3","name":"Accommodation Booking","description":"Reserve a 4- or 5-star hotel in the chosen Chinese city. Options include brands like Shangri-La, Hyatt, or Hilton. Look for hotels with business centers, reliable Wi-Fi, and convenient access to meeting locations. Aim for approximately $150-$250 per night.","status":"PENDING","metadata":{},"warning":"Accommodation booking in China violates the travel advisory regarding mandatory quarantine. Booking a hotel prior to completing quarantine is not compliant.","alternative":"Book accommodation for after the mandatory 5-day quarantine period, or book quarantine-specific accommodation if available and required by local regulations. Coordinate with the hotel to ensure they are aware of quarantine requirements.","completed":false},{"id":"dde03bc8-717a-4616-9618-20581254c66f","name":"Airport Transfers","description":"Arrange for private airport transfers to and from the hotel using a reputable service. Pre-booking guarantees a smooth and reliable arrival and departure experience, minimizing potential delays and language barriers. Consider options like Blacklane or local chauffeur services.","status":"PENDING","metadata":{},"warning":"This step arranges airport transfers upon arrival in China from India. The active advisory mandates a 5-day quarantine upon arrival in China from India, which affects transportation plans.","alternative":"Ensure the airport transfer service is aware of the quarantine requirement and arranges transportation to the designated quarantine location (if not the hotel). Confirm that transfers are permitted or arranged by the quarantine facility.","completed":false},{"id":"351b179c-cb60-4d09-beb2-3eeed6fccced","name":"Business Meeting Arrangements","description":"Coordinate meeting schedules and locations. Consider renting meeting rooms at the hotel or at a dedicated business center, ensuring necessary equipment (projector, screen, Wi-Fi) is available. Arrange for translation services if needed.","status":"PENDING","metadata":{},"warning":"This step involves arranging business meetings in China after arriving from India. The active advisory mandates a 5-day quarantine upon arrival in China from India, which would delay the ability to attend meetings.","alternative":"Reschedule meetings to begin after the 5-day quarantine period has ended. Alternatively, explore options for virtual meetings during the quarantine period.","completed":false},{"id":"bef857a4-1936-45fb-b817-e724c996d7b6","name":"Cultural Immersion & Networking","description":"Plan for evening activities to foster relationships. Consider a traditional Chinese dinner at a well-regarded restaurant or tickets to a cultural performance (e.g., Peking Opera, Kung Fu show). This allows for informal networking opportunities.","status":"PENDING","metadata":{},"warning":"This step involves planning cultural immersion and networking activities in China after arriving from India. The active advisory mandates a 5-day quarantine upon arrival in China from India, delaying the ability to participate in these activities.","alternative":"Reschedule these activities to begin after the 5-day quarantine period has ended. Alternatively, consider virtual networking opportunities during the quarantine period.","completed":false},{"id":"9438c818-7654-4d61-8292-758b6def06ce","name":"Travel Insurance","description":"Purchase comprehensive travel insurance that covers medical emergencies, trip cancellations, and lost belongings. Ensure the policy is valid for China and includes coverage for business activities. Consider providers like Allianz or World Nomads.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"f3c0f7aa-a819-474a-ab8c-7a0709119684","name":"Local Transportation","description":"Familiarize yourself with the local transportation options, such as the subway system, taxis, and ride-sharing apps (if available and reliable in the chosen city). Download relevant apps (e.g., Didi) for ease of use. Consider hiring a local interpreter/guide for assistance with navigation and communication.","status":"PENDING","metadata":{},"warning":"Local transportation in China violates the mandatory 5-day quarantine advisory upon arrival in China. Local transportation is prohibited during the quarantine period except transport to quarantine location.","alternative":"Use the mandatory transport to the quarantine location. Local transport is only required after the quarantine period is complete.","completed":false},{"id":"ede2929c-ce64-4d25-a6b3-f719dec256ad","name":"Currency Exchange & Spending Money","description":"Exchange Indian Rupees to Chinese Yuan before departure or upon arrival at the airport. Inform your bank about your travel dates to avoid card blocking. Budget for meals, transportation, incidentals, and potential souvenirs.","status":"PENDING","metadata":{},"warning":"Currency exchange is premature as quarantine measures on arrival from India to China may affect travel plans. The 5-day mandatory quarantine from India to China may result in unused currency if the trip is cancelled.","alternative":"Exchange currency closer to the date when activities AFTER the 5-day mandatory quarantine are scheduled.","completed":false}],"travelDate":"2026-07-01","finished":false},{"id":"6980b21ec5286848e9c09572","agentId":null,"customerName":"Luxury Tokyo Exploration: A Week of Wonder","customerEmail":"ishan@wyzard.ai","source":"null","destination":"Tokyo","steps":[{"id":"step-161074882086291-0","name":"Flights and Transfers","description":"Secure round-trip business class flights to Narita (NRT) or Haneda (HND) airport. Suggest options like ANA or JAL for superior comfort. Arrange private airport transfer via limousine to the hotel, ensuring seamless arrival.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"step-161074885277666-1","name":"Luxury Accommodation","description":"Book a luxurious stay at a five-star hotel like the Mandarin Oriental Tokyo, The Ritz-Carlton Tokyo, or the Aman Tokyo. Consider a suite with city views and access to exclusive club lounges. Confirm early check-in and late check-out if available.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"step-161074885283332-2","name":"Immersive Tokyo Tours","description":"Curate a private guided tour of Tokyo's highlights: Tsukiji Outer Market (for a gourmet experience), Senso-ji Temple (for cultural immersion), and the Imperial Palace East Garden. Include a personalized sake tasting experience and a traditional tea ceremony. Arrange a helicopter tour for panoramic city views.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"step-161074885285874-3","name":"Culinary Delights","description":"Make reservations at Michelin-starred restaurants like Sukiyabashi Jiro (sushi), Nihonryori RyuGin (modern Japanese), and Den (innovative cuisine). Secure private dining experiences if desired. Consider a cooking class focused on traditional Japanese cuisine.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"step-161074885288041-4","name":"Day Trip to Hakone","description":"Plan a day trip to Hakone, a mountain resort town known for its hot springs, natural beauty, and views of Mount Fuji. Arrange a private car and driver for the day. Include a cruise on Lake Ashi and a visit to the Hakone Open-Air Museum.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"step-161074885290082-5","name":"Visa and Insurance","description":"Confirm Japan's visa requirements based on the client's nationality. Assist with the visa application process if needed. Purchase comprehensive travel insurance covering medical emergencies, trip cancellations, and lost luggage. Ensure policy details are easily accessible.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"step-161074885292124-6","name":"Pocket WiFi and Transportation","description":"Arrange for a pocket WiFi device for seamless internet access throughout the trip. Purchase a Japan Rail Pass if extensive travel outside Tokyo is planned. Provide detailed information on using Tokyo's efficient public transportation system, including subway and train maps.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"step-161074885294166-7","name":"Optional Activities","description":"Offer options for additional activities such as sumo wrestling viewing, a visit to a Robot Restaurant, a traditional Kabuki performance, or exploring Tokyo's vibrant nightlife in areas like Shibuya or Shinjuku. Provide personalized recommendations based on the client's interests.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false}],"travelDate":"2024-03-08","finished":false},{"id":"6980b2bfc5286848e9c09574","agentId":null,"customerName":"Enchanting Parisian Escape: June 2026","customerEmail":"ishan@wyzard.ai","source":"null","destination":"Paris","steps":[{"id":"step-161237532728457-0","name":"Flights & Transfers","description":"Secure round-trip premium economy flights to Charles de Gaulle Airport (CDG) with Air France. Arrange private airport transfer via Mercedes S-Class to your hotel.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"step-161237535650166-1","name":"Luxury Accommodation","description":"Check into the Four Seasons Hotel George V, Paris. Book a spacious suite with Eiffel Tower view for a 7-night stay, including daily breakfast and access to the hotel spa.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"step-161237535658541-2","name":"Iconic Parisian Tours","description":"Embark on a private guided tour of the Louvre Museum, focusing on masterpieces like the Mona Lisa. Enjoy a gourmet dinner cruise on the Seine River with live music. Book skip-the-line access to the Eiffel Tower and ascend to the top for panoramic city views.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"step-161237535662749-3","name":"Cultural Immersion","description":"Attend a performance at the Palais Garnier (Paris Opera). Take a private walking tour of Montmartre, visiting the Sacré-Cœur Basilica and artist studios. Indulge in a macaron-making class at a renowned patisserie.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"step-161237535666416-4","name":"Culinary Delights","description":"Reserve a table at a Michelin-starred restaurant for a multi-course tasting menu experience. Enjoy a wine tasting session in the Marais district, sampling regional French wines. Discover local delicacies at a Parisian market with a personal chef who prepares a private meal.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"step-161237535672332-5","name":"Travel Documentation & Insurance","description":"Confirm visa requirements (if applicable) for France based on nationality. Purchase comprehensive travel insurance covering medical emergencies, trip cancellations, and lost luggage. Ensure passport validity for at least six months beyond the return date.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false}],"travelDate":"2026-06-01","finished":false},{"id":"2679388d-bc21-4198-9e3e-a04d6872cf73","agentId":null,"customerName":"Enchanting Parisian Escape: June 2026 (Advisory Review)","customerEmail":null,"source":"null","destination":"Paris","steps":[{"id":"advisory-guidance-161255730408207","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: Cancellation fees may apply depending on individual booking components (flights, hotels, tours). Rescheduling may incur fare/price differences depending on availability and season. Please allow time for me to calculate these for your specific booking., Delay: Determining costs and alternative bookings will take approximately 2-3 hours.","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Travel Agent Name] calling from [Travel Agency Name] regarding your Enchanting Parisian Escape booked for June 1st, 2026.\n\nI'm calling with urgent news regarding a newly issued Travel Advisory for Paris. A HIGH severity advisory has been issued due to a widespread bed bug infestation impacting accommodations and potentially transportation across the city. This could significantly impact the quality and comfort of your trip. I understand this is very disappointing to hear, and I want to assure you that we're here to help you navigate this situation.\n\nGiven the HIGH severity, we strongly advise against traveling to Paris at this time. Bed bug infestations can be extremely unpleasant, resulting in bites, itching, and potential property damage. Dealing with this during your vacation could be highly stressful.\n\nYour options are:\n\n*   **Cancellation:** We can cancel your trip. Please be aware that cancellation fees may apply depending on the specific terms and conditions of your bookings (flights, hotels, tours, etc.). I will need to review your booking details to determine the exact amount. We’ll do everything we can to minimize these costs.\n\n*   **Reschedule:** We can reschedule your trip to a later date, hoping the situation will improve. Paris is typically beautiful, and we'd love for you to experience it when it’s at its best. If you’re flexible with dates, we can explore options for later in the year, or even into 2027. Keep in mind that rescheduling could result in fare and accommodation price differences depending on availability and seasonality.\n\n*   **Alternative Destination:** If you're open to it, we could explore alternative destinations with a similar appeal to Paris, but without the current issues. This would likely involve new bookings, and costs would vary depending on the new destination and itinerary.\n\nTo proceed, I need your direction. Please let me know which option you'd like to explore first. I can then investigate the associated costs and availability for each option. I’m available to discuss this further and answer any questions you may have. Please don't hesitate to ask anything that's on your mind.\n","advisoryId":"6980b2cbc5286848e9c09575","estimatedTimeDelay":"Determining costs and alternative bookings will take approximately 2-3 hours.","estimatedCost":"Cancellation fees may apply depending on individual booking components (flights, hotels, tours). Rescheduling may incur fare/price differences depending on availability and season. Please allow time for me to calculate these for your specific booking.","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"f22a7975-f9a4-48d6-bf63-98a4ce7cc394","name":"Flights & Transfers","description":"Secure round-trip premium economy flights to Charles de Gaulle Airport (CDG) with Air France. Arrange private airport transfer via Mercedes S-Class to your hotel.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"8df1184f-657c-438b-8cd4-bba294d46253","name":"Luxury Accommodation","description":"Check into the Four Seasons Hotel George V, Paris. Book a spacious suite with Eiffel Tower view for a 7-night stay, including daily breakfast and access to the hotel spa.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"fa2bace3-7f13-4ae9-90a4-da86a06fd436","name":"Iconic Parisian Tours","description":"Embark on a private guided tour of the Louvre Museum, focusing on masterpieces like the Mona Lisa. Enjoy a gourmet dinner cruise on the Seine River with live music. Book skip-the-line access to the Eiffel Tower and ascend to the top for panoramic city views.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"7e299247-b2aa-4cfe-b1b3-c3a0814afe49","name":"Cultural Immersion","description":"Attend a performance at the Palais Garnier (Paris Opera). Take a private walking tour of Montmartre, visiting the Sacré-Cœur Basilica and artist studios. Indulge in a macaron-making class at a renowned patisserie.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"0fbc0933-f10e-40dd-be58-61806bb8e3a4","name":"Culinary Delights","description":"Reserve a table at a Michelin-starred restaurant for a multi-course tasting menu experience. Enjoy a wine tasting session in the Marais district, sampling regional French wines. Discover local delicacies at a Parisian market with a personal chef who prepares a private meal.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"d9ad89e6-98b8-41f5-ab0c-0e33d7cf4780","name":"Travel Documentation & Insurance","description":"Confirm visa requirements (if applicable) for France based on nationality. Purchase comprehensive travel insurance covering medical emergencies, trip cancellations, and lost luggage. Ensure passport validity for at least six months beyond the return date.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false}],"travelDate":"2026-06-01","finished":false}]