[{"id":"6980d8f0f1fe6b5076e2d326","agentId":null,"customerName":"Executive Business Trip to China - July 2026","customerEmail":"ishan@wyzard.ai","source":"India","destination":"China","steps":[{"id":"step-170189685988749-0","name":"Flights (Logistics)","description":"Book round-trip business class flights from a major Indian city (e.g., Delhi, Mumbai) to a major Chinese city (e.g., Beijing, Shanghai) with a reputable airline like Air China or China Eastern. Consider direct flights or flights with minimal layovers to optimize travel time. Specific flight options will be confirmed based on availability and preferred airport location near intended business activity.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"step-170189697391124-1","name":"Airport Transfers (Logistics)","description":"Arrange private airport transfers in both India (departure city) and China (arrival city) using a premium service with a chauffeur-driven car. This ensures a smooth and comfortable transition to and from the airports. Options include black car service and private car rentals. Pre-booking is essential.","status":"PENDING","metadata":{},"warning":"The itinerary includes airport transfers in China, immediately upon arrival from India. Given the mandatory 5-day quarantine for travelers from India to China, this step will need to be modified to reflect that.","alternative":"The airport transfer should take the traveler to a pre-approved quarantine location (hotel or facility). Arrange for a quarantine-compliant transfer service. Regular private transfers can be scheduled AFTER the 5-day quarantine.","completed":false},{"id":"step-170189697399874-2","name":"Accommodation (Hotels)","description":"Reserve a luxurious suite at a 5-star hotel in the chosen Chinese city (e.g., The Peninsula Shanghai, Four Seasons Hotel Beijing). Ensure the hotel offers business amenities such as a well-equipped business center, high-speed internet, and executive lounge access. Consider the hotel's proximity to the primary business meeting locations.","status":"PENDING","metadata":{},"warning":"The itinerary includes booking a luxurious suite at a 5-star hotel upon arrival in China from India. However, due to the mandatory 5-day quarantine, this is not immediately possible.","alternative":"Initially, book accommodation in a pre-approved quarantine hotel or facility for the first 5 days. After the quarantine period, the traveler can transfer to the originally planned 5-star hotel. Alternatively, the 5-star hotel may be quarantine-approved.","completed":false},{"id":"step-170189697402958-3","name":"Visa Processing (Docs)","description":"Initiate the Chinese visa application process well in advance. Assist with document preparation, including passport validity checks, visa application forms, invitation letters (if required), and any supporting documents. Explore expedited visa processing options to ensure timely visa acquisition. We will provide a detailed checklist of necessary documents based on the most recent consulate requirements for Indian citizens traveling to China for business.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"step-170189697406499-4","name":"Travel Insurance (Docs)","description":"Secure comprehensive travel insurance that covers medical emergencies, trip cancellations, lost luggage, and other unforeseen events. Ensure the insurance policy covers business-related activities and provides adequate coverage for China. The policy will need to include emergency medical evacuation. Confirm the insurance provider is reputable and accessible 24/7.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"step-170189697408916-5","name":"Business Meeting Logistics (Key Activities)","description":"Assist with the organization and logistics of business meetings. This includes arranging meeting rooms, presentation equipment, translation services (if required), and catering. Explore potential business networking events or industry conferences relevant to the client's field. Confirm meeting schedules and locations with the client's Chinese counterparts.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"step-170189697411333-6","name":"Cultural Immersion (Key Activities/Optional)","description":"Arrange for a private guided tour of culturally significant sites in the Chinese city (e.g., Forbidden City, Great Wall of China). Suggest a traditional Chinese dinner at a renowned restaurant. Offer opportunities to experience local culture and customs respectfully. This portion of the trip is optional but is highly encouraged to foster stronger business relationships.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"step-170189697413666-7","name":"Internal Transportation (Logistics)","description":"Book private transportation (car with driver) for all internal travel within the Chinese city to ensure punctuality and comfort for meetings and activities. If appropriate given destination, explore high-speed train options. Ensure any transfers between cities are smooth and efficient.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false}],"travelDate":"2026-07-01","finished":false},{"id":"039a0a88-1301-44ae-83f9-5b5049661189","agentId":null,"customerName":"Executive Business Trip to China - July 2026 (Advisory Review)","customerEmail":"ishan@wyzard.ai","source":"India","destination":"China","steps":[{"id":"advisory-guidance-170238574364708","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: $500, Delay: 5 days","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Travel Agent Name] calling from [Travel Agency]. I'm calling with an urgent update regarding your upcoming business trip to China on July 1st, 2026.\n\nA new travel advisory has just been issued by [Source - e.g., health organization, government], and it's classified as HIGH severity. This advisory mandates a mandatory 5-day quarantine upon arrival in China from India. This means you will be required to isolate in a designated facility, or possibly your hotel room, for five days immediately upon arrival. \n\nI understand this will significantly impact your trip's schedule. Essentially, you'll lose five days of productive business time. The quarantine will involve strict protocols, including daily health checks, limited contact with others, and adherence to the facility’s regulations. This could influence the success of your business objectives in China. \n\nDepending on your hotel and other pre-booked arrangements, there may be costs associated with either modifying or cancelling those reservations. Similarly, changing your flight dates might incur change fees, or result in increased fare costs due to potential price fluctuations. Let me quickly check on the potential cost implications associated with these changes. (Pause to check system). Okay, I am seeing potential change fees of approximately [Estimated Fee Amount] for rescheduling the flights and [Estimated Fee Amount] for the changes to hotel and other pre-booked items, depending on the chosen new dates. These are, of course, preliminary and subject to availability.\n\nGiven the mandatory quarantine, would you consider postponing your trip by at least five days, perhaps to start your travel on or after July 6th? This would allow you to complete the quarantine period before starting your business activities. Alternatively, we could explore alternative destinations that do not currently have quarantine requirements if the timing of your trip is flexible and your business objectives can be achieved elsewhere. I will email you alternative dates and destination options with estimated price. Let me know if you have any questions or concerns.","advisoryId":"6980d91cf1fe6b5076e2d327","estimatedTimeDelay":"5 days","estimatedCost":"$500","isAdvisoryTask":true},"warning":"The 'Advisory Impact Review' step already includes a 5-day delay; however, it's crucial to verify that this delay accurately reflects the current mandatory quarantine period and covers all associated costs.","alternative":"Confirm the 5-day delay in the 'Advisory Impact Review' step is sufficient to accommodate the current mandatory quarantine requirement from India to China and any associated mandatory testing times. Update cost estimations to include quarantine facility/hotel costs, food, medical support, and any additional mandatory testing costs.","completed":false},{"id":"bf2549c3-b912-47f6-a0f7-a2b5f3268f76","name":"Flights (Logistics)","description":"Book round-trip business class flights from a major Indian city (e.g., Delhi, Mumbai) to a major Chinese city (e.g., Beijing, Shanghai) with a reputable airline like Air China or China Eastern. Consider direct flights or flights with minimal layovers to optimize travel time. Specific flight options will be confirmed based on availability and preferred airport location near intended business activity.","status":"PENDING","metadata":{},"warning":"Flights from India to China are subject to a mandatory quarantine upon arrival in China. This step facilitates travel from India to China which violates the active travel advisory requiring quarantine.","alternative":"Postpone flights from India to China until the quarantine advisories are lifted, or reroute the trip through a country without such advisories, followed by the appropriate quarantine period in the intermediary country.","completed":false},{"id":"9feae87d-1f07-4d5d-83de-eab521862099","name":"Airport Transfers (Logistics)","description":"Arrange private airport transfers in both India (departure city) and China (arrival city) using a premium service with a chauffeur-driven car. This ensures a smooth and comfortable transition to and from the airports. Options include black car service and private car rentals. Pre-booking is essential.","status":"PENDING","metadata":{},"warning":"Airport transfers in China, for passengers arriving from India, will be affected by the mandatory quarantine. Upon arrival in China, the traveller will not be able to utilize standard premium transfer services without undergoing quarantine first.","alternative":"Arrange for direct transfer to a designated quarantine facility upon arrival in China, as mandated by the travel advisory. Post-quarantine, premium transfers can be arranged.","completed":false},{"id":"b71aa3e9-e539-43a9-9987-269a38d7426a","name":"Accommodation (Hotels)","description":"Reserve a luxurious suite at a 5-star hotel in the chosen Chinese city (e.g., The Peninsula Shanghai, Four Seasons Hotel Beijing). Ensure the hotel offers business amenities such as a well-equipped business center, high-speed internet, and executive lounge access. Consider the hotel's proximity to the primary business meeting locations.","status":"PENDING","metadata":{},"warning":"Hotel accommodations in China will be impacted by the mandatory quarantine requirement for travellers from India. The traveller won't be able to immediately check into the 5-star hotel upon arrival.","alternative":"Book a quarantine hotel as designated by the Chinese authorities for the initial quarantine period. After completing the quarantine, the 5-star hotel can be booked.","completed":false},{"id":"38dbaf79-a355-4d8b-950e-967564d8ce46","name":"Visa Processing (Docs)","description":"Initiate the Chinese visa application process well in advance. Assist with document preparation, including passport validity checks, visa application forms, invitation letters (if required), and any supporting documents. Explore expedited visa processing options to ensure timely visa acquisition. We will provide a detailed checklist of necessary documents based on the most recent consulate requirements for Indian citizens traveling to China for business.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"42171e43-e7f5-4da0-b624-b9d339c55916","name":"Travel Insurance (Docs)","description":"Secure comprehensive travel insurance that covers medical emergencies, trip cancellations, lost luggage, and other unforeseen events. Ensure the insurance policy covers business-related activities and provides adequate coverage for China. The policy will need to include emergency medical evacuation. Confirm the insurance provider is reputable and accessible 24/7.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"ad0fa5f2-d9cf-4ec7-bf66-6a9b9422cee2","name":"Business Meeting Logistics (Key Activities)","description":"Assist with the organization and logistics of business meetings. This includes arranging meeting rooms, presentation equipment, translation services (if required), and catering. Explore potential business networking events or industry conferences relevant to the client's field. Confirm meeting schedules and locations with the client's Chinese counterparts.","status":"PENDING","metadata":{},"warning":"Business meeting logistics in China are not feasible immediately upon arrival from India due to the mandatory quarantine. Scheduled meetings would need to be delayed or conducted remotely.","alternative":"Reschedule physical meetings to commence after the quarantine period. Utilize virtual meeting platforms during the quarantine period to maintain business operations.","completed":false},{"id":"51d24056-3bfa-4610-90ff-44d90b503783","name":"Cultural Immersion (Key Activities/Optional)","description":"Arrange for a private guided tour of culturally significant sites in the Chinese city (e.g., Forbidden City, Great Wall of China). Suggest a traditional Chinese dinner at a renowned restaurant. Offer opportunities to experience local culture and customs respectfully. This portion of the trip is optional but is highly encouraged to foster stronger business relationships.","status":"PENDING","metadata":{},"warning":"Cultural immersion activities in China are not possible immediately after arrival from India due to the mandatory quarantine requirement.","alternative":"Schedule any cultural immersion activities after the completion of the mandatory quarantine period.","completed":false},{"id":"b8955c2a-c5e0-4fce-9501-51d2ef734997","name":"Internal Transportation (Logistics)","description":"Book private transportation (car with driver) for all internal travel within the Chinese city to ensure punctuality and comfort for meetings and activities. If appropriate given destination, explore high-speed train options. Ensure any transfers between cities are smooth and efficient.","status":"PENDING","metadata":{},"warning":"Internal transportation plans within China are subject to disruption due to the quarantine requirement for travellers from India. The traveller is legally obligated to be at the designated quarantine facilities.","alternative":"Internal travel plans should only commence after the mandatory quarantine period is completed.","completed":false}],"travelDate":"2026-07-01","finished":false},{"id":"53d001e5-a4fc-47ab-bc33-8023924e575a","agentId":null,"customerName":"Executive Business Trip to China - July 2026 (Advisory Review)","customerEmail":"ishan@wyzard.ai","source":"India","destination":"China","steps":[{"id":"advisory-guidance-171486106107416","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: Calculating... Will advise as soon as possible once options are identified, Delay: 5 days (due to mandatory quarantine)","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Travel Agent Name] from [Travel Agency Name]. I'm calling regarding your upcoming business trip to China on July 1st, 2026.\n\nA new travel advisory has just been issued for travel from India to China, and unfortunately, it's classified as HIGH severity. This means there's a significant change impacting your travel plans. The advisory mandates a mandatory 5-day quarantine upon arrival in China.\n\nThis mandatory quarantine will significantly impact your trip. It will require you to spend 5 days in a designated quarantine facility upon arrival, which could disrupt your meeting schedule and overall itinerary. \n\nWe understand this is likely very disruptive news. We are exploring the options available to you.\n\nFirstly, completing the mandatory quarantine means your trip will be delayed by at least 5 days. Secondly, depending on your specific ticket and hotel booking conditions, there may be costs associated with changing or canceling your existing arrangements. These could include cancellation fees from the airline, hotel, or other services, as well as potential fare differences if we need to rebook flights for a later date. I will look into the specifics for your booking immediately.\n\nDepending on your schedule's flexibility, we could explore alternative dates for your travel. Moving your trip by at least 5 days later than originally planned in July might allow you to avoid needing to cut down the amount of days you would be able to conduct business in China. Do you have any flexibility in your travel dates? If not, we can explore alternative routes or destinations, though this would likely incur further changes in cost.\n\nI understand this is a lot to take in. I'm here to help you navigate this situation and find the best possible solution. Let's discuss your options and determine the best course of action. What are your thoughts?","advisoryId":"6980ddfcf1fe6b5076e2d328","estimatedTimeDelay":"5 days (due to mandatory quarantine)","estimatedCost":"Calculating... Will advise as soon as possible once options are identified","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"6ecb6f55-584f-4dc5-b466-8d6bce27ab6b","name":"Flights (Logistics)","description":"Book round-trip business class flights from a major Indian city (e.g., Delhi, Mumbai) to a major Chinese city (e.g., Beijing, Shanghai) with a reputable airline like Air China or China Eastern. Consider direct flights or flights with minimal layovers to optimize travel time. Specific flight options will be confirmed based on availability and preferred airport location near intended business activity.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"dfc36366-0672-486e-9238-670d2d755c4f","name":"Airport Transfers (Logistics)","description":"Arrange private airport transfers in both India (departure city) and China (arrival city) using a premium service with a chauffeur-driven car. This ensures a smooth and comfortable transition to and from the airports. Options include black car service and private car rentals. Pre-booking is essential.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"d775b074-c3b5-49a2-aba7-c4533c6a14bc","name":"Accommodation (Hotels)","description":"Reserve a luxurious suite at a 5-star hotel in the chosen Chinese city (e.g., The Peninsula Shanghai, Four Seasons Hotel Beijing). Ensure the hotel offers business amenities such as a well-equipped business center, high-speed internet, and executive lounge access. Consider the hotel's proximity to the primary business meeting locations.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"c9ad1afa-378f-4f7e-82e5-985f879c2e56","name":"Visa Processing (Docs)","description":"Initiate the Chinese visa application process well in advance. Assist with document preparation, including passport validity checks, visa application forms, invitation letters (if required), and any supporting documents. Explore expedited visa processing options to ensure timely visa acquisition. We will provide a detailed checklist of necessary documents based on the most recent consulate requirements for Indian citizens traveling to China for business.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"d5eaa0e6-56ea-4e3c-9e98-8fd917df230e","name":"Travel Insurance (Docs)","description":"Secure comprehensive travel insurance that covers medical emergencies, trip cancellations, lost luggage, and other unforeseen events. Ensure the insurance policy covers business-related activities and provides adequate coverage for China. The policy will need to include emergency medical evacuation. Confirm the insurance provider is reputable and accessible 24/7.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"281d5404-74a3-4584-a423-4c672f3156ca","name":"Business Meeting Logistics (Key Activities)","description":"Assist with the organization and logistics of business meetings. This includes arranging meeting rooms, presentation equipment, translation services (if required), and catering. Explore potential business networking events or industry conferences relevant to the client's field. Confirm meeting schedules and locations with the client's Chinese counterparts.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"0ab12a98-e41a-49d7-af73-fa620dbab869","name":"Cultural Immersion (Key Activities/Optional)","description":"Arrange for a private guided tour of culturally significant sites in the Chinese city (e.g., Forbidden City, Great Wall of China). Suggest a traditional Chinese dinner at a renowned restaurant. Offer opportunities to experience local culture and customs respectfully. This portion of the trip is optional but is highly encouraged to foster stronger business relationships.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"0e7518a3-b46e-4105-8824-f0f6870cb2ea","name":"Internal Transportation (Logistics)","description":"Book private transportation (car with driver) for all internal travel within the Chinese city to ensure punctuality and comfort for meetings and activities. If appropriate given destination, explore high-speed train options. Ensure any transfers between cities are smooth and efficient.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false}],"travelDate":"2026-07-01","finished":false},{"id":"5d44a6f1-dbf8-45cb-9636-0ce1094e0c07","agentId":null,"customerName":"Executive Business Trip to China - July 2026 (Advisory Review) (Advisory Review)","customerEmail":"ishan@wyzard.ai","source":"India","destination":"China","steps":[{"id":"advisory-guidance-171493972697583","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: Dependent on chosen option. Cancellation fees typically range from $100 to $500, and fare differences can vary widely. A detailed cost breakdown will be provided after selecting an option., Delay: 5 days, if proceeding with the original plan.","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Travel Agent Name] calling from [Travel Agency Name] regarding your upcoming business trip to China on July 1st, 2026.\n\nWe've just received a high-severity travel advisory from [Authority Name] impacting travel from India to China, and it directly affects your booking. The advisory mandates a 5-day quarantine period upon arrival in China.\n\nThis means that upon arrival in China, you will be required to quarantine in a designated facility for five full days before you can proceed with your business activities. This could significantly impact your schedule and the purpose of your trip.\n\nBefore we proceed I want to let you know that your safety and well-being are my top priority. \n\nSeveral options are available to you, and I want to take the time to explore them with you to make the best decision possible. First, we could keep your itinerary as is, but factor in the 5-day quarantine period. We could look at pushing the trip back to later in July, or even August, in the hopes that the advisory will be lifted or amended. Or we could look at rerouting your trip if the China portion is not absolutely essential.\n\nPlease be aware that changing your travel dates or rerouting your trip may incur additional costs. Depending on the airline's policies and the fare class of your ticket, there may be cancellation or change fees. Rebooking for later dates could also result in higher airfares and potentially different hotel rates. I will need to investigate these costs specifically related to your booking once we decide on the best course of action.\n\nLet’s discuss your priorities for this trip. Is the timing flexible? Is the meeting location set in stone? Understanding your needs will help me find the most suitable solution. We will explore all available options, including potential waivers due to the circumstances, to minimize any financial impact.\n\nWhat would you like to do?","advisoryId":"6980ddfcf1fe6b5076e2d328","estimatedTimeDelay":"5 days, if proceeding with the original plan.","estimatedCost":"Dependent on chosen option. Cancellation fees typically range from $100 to $500, and fare differences can vary widely. A detailed cost breakdown will be provided after selecting an option.","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"bfbf8f56-bdf8-4018-a8a8-959b8c1bf962","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: $500, Delay: 5 days","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Travel Agent Name] calling from [Travel Agency]. I'm calling with an urgent update regarding your upcoming business trip to China on July 1st, 2026.\n\nA new travel advisory has just been issued by [Source - e.g., health organization, government], and it's classified as HIGH severity. This advisory mandates a mandatory 5-day quarantine upon arrival in China from India. This means you will be required to isolate in a designated facility, or possibly your hotel room, for five days immediately upon arrival. \n\nI understand this will significantly impact your trip's schedule. Essentially, you'll lose five days of productive business time. The quarantine will involve strict protocols, including daily health checks, limited contact with others, and adherence to the facility’s regulations. This could influence the success of your business objectives in China. \n\nDepending on your hotel and other pre-booked arrangements, there may be costs associated with either modifying or cancelling those reservations. Similarly, changing your flight dates might incur change fees, or result in increased fare costs due to potential price fluctuations. Let me quickly check on the potential cost implications associated with these changes. (Pause to check system). Okay, I am seeing potential change fees of approximately [Estimated Fee Amount] for rescheduling the flights and [Estimated Fee Amount] for the changes to hotel and other pre-booked items, depending on the chosen new dates. These are, of course, preliminary and subject to availability.\n\nGiven the mandatory quarantine, would you consider postponing your trip by at least five days, perhaps to start your travel on or after July 6th? This would allow you to complete the quarantine period before starting your business activities. Alternatively, we could explore alternative destinations that do not currently have quarantine requirements if the timing of your trip is flexible and your business objectives can be achieved elsewhere. I will email you alternative dates and destination options with estimated price. Let me know if you have any questions or concerns.","estimatedTimeDelay":"5 days","advisoryId":"6980d91cf1fe6b5076e2d327","estimatedCost":"$500","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"7ecc8859-2080-4fe7-b92f-45332fe556f0","name":"Flights (Logistics)","description":"Book round-trip business class flights from a major Indian city (e.g., Delhi, Mumbai) to a major Chinese city (e.g., Beijing, Shanghai) with a reputable airline like Air China or China Eastern. Consider direct flights or flights with minimal layovers to optimize travel time. Specific flight options will be confirmed based on availability and preferred airport location near intended business activity.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"f35de960-40a2-45cf-bc05-d3760a53aa8e","name":"Airport Transfers (Logistics)","description":"Arrange private airport transfers in both India (departure city) and China (arrival city) using a premium service with a chauffeur-driven car. This ensures a smooth and comfortable transition to and from the airports. Options include black car service and private car rentals. Pre-booking is essential.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"c6ff2d4a-03aa-4b24-aa4f-b7dd0b2fe9f2","name":"Accommodation (Hotels)","description":"Reserve a luxurious suite at a 5-star hotel in the chosen Chinese city (e.g., The Peninsula Shanghai, Four Seasons Hotel Beijing). Ensure the hotel offers business amenities such as a well-equipped business center, high-speed internet, and executive lounge access. Consider the hotel's proximity to the primary business meeting locations.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"13f7a507-d384-4aee-8b2e-2ee81e64e6e5","name":"Visa Processing (Docs)","description":"Initiate the Chinese visa application process well in advance. Assist with document preparation, including passport validity checks, visa application forms, invitation letters (if required), and any supporting documents. Explore expedited visa processing options to ensure timely visa acquisition. We will provide a detailed checklist of necessary documents based on the most recent consulate requirements for Indian citizens traveling to China for business.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"2803caef-36cb-4ec4-9313-2d02dc621364","name":"Travel Insurance (Docs)","description":"Secure comprehensive travel insurance that covers medical emergencies, trip cancellations, lost luggage, and other unforeseen events. Ensure the insurance policy covers business-related activities and provides adequate coverage for China. The policy will need to include emergency medical evacuation. Confirm the insurance provider is reputable and accessible 24/7.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"fb6355e0-69f8-4f6c-9004-e7fd39975294","name":"Business Meeting Logistics (Key Activities)","description":"Assist with the organization and logistics of business meetings. This includes arranging meeting rooms, presentation equipment, translation services (if required), and catering. Explore potential business networking events or industry conferences relevant to the client's field. Confirm meeting schedules and locations with the client's Chinese counterparts.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"28d8deb7-6357-4647-942f-0bb12a95c812","name":"Cultural Immersion (Key Activities/Optional)","description":"Arrange for a private guided tour of culturally significant sites in the Chinese city (e.g., Forbidden City, Great Wall of China). Suggest a traditional Chinese dinner at a renowned restaurant. Offer opportunities to experience local culture and customs respectfully. This portion of the trip is optional but is highly encouraged to foster stronger business relationships.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"6c9d0290-8481-472d-b3f3-a9e7e30a3dc4","name":"Internal Transportation (Logistics)","description":"Book private transportation (car with driver) for all internal travel within the Chinese city to ensure punctuality and comfort for meetings and activities. If appropriate given destination, explore high-speed train options. Ensure any transfers between cities are smooth and efficient.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false}],"travelDate":"2026-07-01","finished":false},{"id":"d65274f9-53ee-43a8-a1e3-655aac53fb2d","agentId":null,"customerName":"Executive Business Trip to China - July 2026 (Advisory Review)","customerEmail":"ishan@wyzard.ai","source":"India","destination":"China","steps":[{"id":"advisory-guidance-171558162625166","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: $0 (Until route change or cancellation is requested), Delay: 8 days (if proceeding with the original plan)","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Travel Agent Name] from [Travel Agency Name]. I'm calling regarding your upcoming business trip to China scheduled for July 1st, 2026. \n\nI need to inform you that a new Travel Advisory has been issued for travel from India to China, and it's classified as HIGH severity. This means it requires immediate attention and action. The advisory mandates a mandatory quarantine period of 8 days upon arrival in China.\n\nThis will significantly impact your trip, as you'll need to spend 8 days in quarantine before you can begin your business activities. This could affect your meeting schedules, and potentially the overall success of your trip. \n\nThere are a few options we can explore. First, we can proceed with the booking as is, understanding that you will need to undergo the mandatory 8-day quarantine. Second, we can explore postponing your trip to a later date, hoping the travel advisory changes. Third, we can explore rerouting if the business meeting can happen in another location. \n\nBe aware that postponing or rerouting may incur costs. These could include cancellation fees from airlines and hotels, as well as potential fare differences if you choose to reschedule. If you proceed as planned there will be additional costs involved with the mandatory quarantine, which we can look into upon your approval. \n\nGiven the severity of the advisory and the impact on your business trip, I strongly recommend we discuss these options in detail as soon as possible. I'm available to assist you in finding the best solution. Which option would you like to explore first?","advisoryId":"6980de44f1fe6b5076e2d329","estimatedTimeDelay":"8 days (if proceeding with the original plan)","estimatedCost":"$0 (Until route change or cancellation is requested)","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"cab71c3d-dacd-43ed-b30c-52e6fd409d2f","name":"Flights (Logistics)","description":"Book round-trip business class flights from a major Indian city (e.g., Delhi, Mumbai) to a major Chinese city (e.g., Beijing, Shanghai) with a reputable airline like Air China or China Eastern. Consider direct flights or flights with minimal layovers to optimize travel time. Specific flight options will be confirmed based on availability and preferred airport location near intended business activity.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"11792647-d989-4e1d-9634-c7be4c1c4413","name":"Airport Transfers (Logistics)","description":"Arrange private airport transfers in both India (departure city) and China (arrival city) using a premium service with a chauffeur-driven car. This ensures a smooth and comfortable transition to and from the airports. Options include black car service and private car rentals. Pre-booking is essential.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"1706316f-df37-4536-a77e-6a8dcec3a002","name":"Accommodation (Hotels)","description":"Reserve a luxurious suite at a 5-star hotel in the chosen Chinese city (e.g., The Peninsula Shanghai, Four Seasons Hotel Beijing). Ensure the hotel offers business amenities such as a well-equipped business center, high-speed internet, and executive lounge access. Consider the hotel's proximity to the primary business meeting locations.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"4cdcb1a5-b1dc-4162-9968-6e3986487ae9","name":"Visa Processing (Docs)","description":"Initiate the Chinese visa application process well in advance. Assist with document preparation, including passport validity checks, visa application forms, invitation letters (if required), and any supporting documents. Explore expedited visa processing options to ensure timely visa acquisition. We will provide a detailed checklist of necessary documents based on the most recent consulate requirements for Indian citizens traveling to China for business.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"b8c5fa33-af07-46f9-afa1-bd8051bc344d","name":"Travel Insurance (Docs)","description":"Secure comprehensive travel insurance that covers medical emergencies, trip cancellations, lost luggage, and other unforeseen events. Ensure the insurance policy covers business-related activities and provides adequate coverage for China. The policy will need to include emergency medical evacuation. Confirm the insurance provider is reputable and accessible 24/7.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"476425c8-5b45-4c71-9656-6e3fa16b5b44","name":"Business Meeting Logistics (Key Activities)","description":"Assist with the organization and logistics of business meetings. This includes arranging meeting rooms, presentation equipment, translation services (if required), and catering. Explore potential business networking events or industry conferences relevant to the client's field. Confirm meeting schedules and locations with the client's Chinese counterparts.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"044b7fae-6f41-478a-9d2c-0b616431f4ad","name":"Cultural Immersion (Key Activities/Optional)","description":"Arrange for a private guided tour of culturally significant sites in the Chinese city (e.g., Forbidden City, Great Wall of China). Suggest a traditional Chinese dinner at a renowned restaurant. Offer opportunities to experience local culture and customs respectfully. This portion of the trip is optional but is highly encouraged to foster stronger business relationships.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"f8764d4e-9594-42ef-b656-8848b802ab66","name":"Internal Transportation (Logistics)","description":"Book private transportation (car with driver) for all internal travel within the Chinese city to ensure punctuality and comfort for meetings and activities. If appropriate given destination, explore high-speed train options. Ensure any transfers between cities are smooth and efficient.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false}],"travelDate":"2026-07-01","finished":false},{"id":"e43c939d-69f7-486e-be0c-18ca4ff593b5","agentId":null,"customerName":"Executive Business Trip to China - July 2026 (Advisory Review) (Advisory Review)","customerEmail":"ishan@wyzard.ai","source":"India","destination":"China","steps":[{"id":"advisory-guidance-171568988626333","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: $ Dependent on customer choices of changes, Delay: 8 days quarantine + flight change delay","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Your Name] from [Travel Agency Name]. I'm calling you today regarding your upcoming executive business trip to China on July 1st, 2026. We've just received a high-severity travel advisory that directly impacts your booking from India to China.\n\nThis advisory mandates a mandatory 8-day quarantine upon arrival in China. This means you will be required to isolate in a designated facility for eight days immediately after landing, which will significantly impact your ability to conduct business meetings as planned.\n\nI understand this is likely disruptive. We need to discuss your options urgently. Depending on your itinerary's flexibility, potential implications include:\n\n*   **Disruption to your schedule:** The 8-day quarantine will delay your business activities.\n*   **Potential cancellation fees:** Depending on the fare rules of your airline ticket and hotel booking, cancellations or changes may incur fees.\n*   **Possible increased costs:** Rescheduling to a different date or rerouting could result in higher airfares and hotel rates, especially booking closer to the travel date.\n\nGiven the high-severity and significant impact of this quarantine, I recommend we explore alternative travel arrangements. Are there any possibilities for shifting your travel dates? Even delaying the trip by a week or two may allow for the advisory to be updated or lifted. We can also explore rerouting to a different location, if your business requirements allow. \n\nI need to know if you'd like me to explore alternative travel dates, rerouting options, or cancellation policies. I'll need your decision promptly so we can minimize potential financial impact and ensure you have the best possible travel solution. Please let me know how you'd like to proceed.","advisoryId":"6980de44f1fe6b5076e2d329","estimatedTimeDelay":"8 days quarantine + flight change delay","estimatedCost":"$ Dependent on customer choices of changes","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"205dc2e9-7ed7-4a91-a140-4f9672ebb6df","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: $500, Delay: 5 days","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Travel Agent Name] calling from [Travel Agency]. I'm calling with an urgent update regarding your upcoming business trip to China on July 1st, 2026.\n\nA new travel advisory has just been issued by [Source - e.g., health organization, government], and it's classified as HIGH severity. This advisory mandates a mandatory 5-day quarantine upon arrival in China from India. This means you will be required to isolate in a designated facility, or possibly your hotel room, for five days immediately upon arrival. \n\nI understand this will significantly impact your trip's schedule. Essentially, you'll lose five days of productive business time. The quarantine will involve strict protocols, including daily health checks, limited contact with others, and adherence to the facility’s regulations. This could influence the success of your business objectives in China. \n\nDepending on your hotel and other pre-booked arrangements, there may be costs associated with either modifying or cancelling those reservations. Similarly, changing your flight dates might incur change fees, or result in increased fare costs due to potential price fluctuations. Let me quickly check on the potential cost implications associated with these changes. (Pause to check system). Okay, I am seeing potential change fees of approximately [Estimated Fee Amount] for rescheduling the flights and [Estimated Fee Amount] for the changes to hotel and other pre-booked items, depending on the chosen new dates. These are, of course, preliminary and subject to availability.\n\nGiven the mandatory quarantine, would you consider postponing your trip by at least five days, perhaps to start your travel on or after July 6th? This would allow you to complete the quarantine period before starting your business activities. Alternatively, we could explore alternative destinations that do not currently have quarantine requirements if the timing of your trip is flexible and your business objectives can be achieved elsewhere. I will email you alternative dates and destination options with estimated price. Let me know if you have any questions or concerns.","estimatedTimeDelay":"5 days","advisoryId":"6980d91cf1fe6b5076e2d327","estimatedCost":"$500","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"6c2a3da1-502b-41ba-ac06-fad9c9c331eb","name":"Flights (Logistics)","description":"Book round-trip business class flights from a major Indian city (e.g., Delhi, Mumbai) to a major Chinese city (e.g., Beijing, Shanghai) with a reputable airline like Air China or China Eastern. Consider direct flights or flights with minimal layovers to optimize travel time. Specific flight options will be confirmed based on availability and preferred airport location near intended business activity.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"15f20449-59b0-4e67-8443-f8edc007210c","name":"Airport Transfers (Logistics)","description":"Arrange private airport transfers in both India (departure city) and China (arrival city) using a premium service with a chauffeur-driven car. This ensures a smooth and comfortable transition to and from the airports. Options include black car service and private car rentals. Pre-booking is essential.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"28674583-9305-4202-aa46-248aaf46d5cd","name":"Accommodation (Hotels)","description":"Reserve a luxurious suite at a 5-star hotel in the chosen Chinese city (e.g., The Peninsula Shanghai, Four Seasons Hotel Beijing). Ensure the hotel offers business amenities such as a well-equipped business center, high-speed internet, and executive lounge access. Consider the hotel's proximity to the primary business meeting locations.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"da6ee618-6f6b-4ab8-ace7-d8310e491d99","name":"Visa Processing (Docs)","description":"Initiate the Chinese visa application process well in advance. Assist with document preparation, including passport validity checks, visa application forms, invitation letters (if required), and any supporting documents. Explore expedited visa processing options to ensure timely visa acquisition. We will provide a detailed checklist of necessary documents based on the most recent consulate requirements for Indian citizens traveling to China for business.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"bbe2ca39-488e-45ed-839c-57c4df496410","name":"Travel Insurance (Docs)","description":"Secure comprehensive travel insurance that covers medical emergencies, trip cancellations, lost luggage, and other unforeseen events. Ensure the insurance policy covers business-related activities and provides adequate coverage for China. The policy will need to include emergency medical evacuation. Confirm the insurance provider is reputable and accessible 24/7.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"6bc2b83d-7c3d-4eb2-8551-61a14551e5a2","name":"Business Meeting Logistics (Key Activities)","description":"Assist with the organization and logistics of business meetings. This includes arranging meeting rooms, presentation equipment, translation services (if required), and catering. Explore potential business networking events or industry conferences relevant to the client's field. Confirm meeting schedules and locations with the client's Chinese counterparts.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"8f7f878e-7ae5-4089-988c-bd4087baa806","name":"Cultural Immersion (Key Activities/Optional)","description":"Arrange for a private guided tour of culturally significant sites in the Chinese city (e.g., Forbidden City, Great Wall of China). Suggest a traditional Chinese dinner at a renowned restaurant. Offer opportunities to experience local culture and customs respectfully. This portion of the trip is optional but is highly encouraged to foster stronger business relationships.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"5a795e08-3913-4fe9-95e8-b168dc733c35","name":"Internal Transportation (Logistics)","description":"Book private transportation (car with driver) for all internal travel within the Chinese city to ensure punctuality and comfort for meetings and activities. If appropriate given destination, explore high-speed train options. Ensure any transfers between cities are smooth and efficient.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false}],"travelDate":"2026-07-01","finished":false},{"id":"c0fc2f1b-7791-4577-a2ac-55213dc06c6b","agentId":null,"customerName":"Executive Business Trip to China - July 2026 (Advisory Review) (Advisory Review)","customerEmail":"ishan@wyzard.ai","source":"India","destination":"China","steps":[{"id":"advisory-guidance-171577401437041","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: $0-Variable (Dependent on choice of rebooking, cancellation, etc. Actual costs will be provided upon investigation of specific flights and accommodation). Possible minimums for cancellation and rebooking start at $500., Delay: 8 days (due to mandatory quarantine if travel proceeds as planned). Additional time for finding new dates/routes may be required.","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Travel Agent Name] from [Travel Agency Name] calling regarding your upcoming executive business trip to China on July 1st, 2026. We've just received a high-severity travel advisory that directly impacts your booking. The advisory mandates an 8-day quarantine upon arrival in China from India.\n\nThis means that upon arrival, you will be required to isolate for 8 full days before you can begin your planned business activities. This is a mandatory requirement by the Chinese authorities, and there are no exceptions that we are aware of.\n\nI understand this is likely disruptive to your business schedule. We want to explore the options available to you to minimize any negative impact. The implications include potentially missing crucial meetings and extending your trip significantly. There may also be cancellation fees associated with your current flights and accommodations, and rebooking for alternative dates or routes could result in higher fares, particularly closer to your original travel date. Let me emphasize the quarantine is mandatory and there are no means to bypass the regulation.\n\nTo help mitigate these issues, we can explore a few options. Firstly, we could postpone your trip to a later date in July or August, hoping that the quarantine restrictions are lifted or eased by then. I will monitor the situation closely and keep you informed. Secondly, if the meeting is vital, we can explore alternative locations outside China that are accessible with fewer restrictions, though this would, of course, depend on the meeting objectives and participants' locations. Finally, we can proceed with the booking as is, acknowledging that you will need to factor in the 8-day quarantine period. However, I strongly advise against this given the potential impact on your business trip. Please let me know your thoughts. I can provide an estimate for any change or cancellation fees, as well as alternative flight and accommodation options based on your preference.","advisoryId":"6980de44f1fe6b5076e2d329","estimatedTimeDelay":"8 days (due to mandatory quarantine if travel proceeds as planned). Additional time for finding new dates/routes may be required.","estimatedCost":"$0-Variable (Dependent on choice of rebooking, cancellation, etc. Actual costs will be provided upon investigation of specific flights and accommodation). Possible minimums for cancellation and rebooking start at $500.","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"dbb8fc16-2bbe-4a81-b6d2-06cc1825f28d","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: Calculating... Will advise as soon as possible once options are identified, Delay: 5 days (due to mandatory quarantine)","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Travel Agent Name] from [Travel Agency Name]. I'm calling regarding your upcoming business trip to China on July 1st, 2026.\n\nA new travel advisory has just been issued for travel from India to China, and unfortunately, it's classified as HIGH severity. This means there's a significant change impacting your travel plans. The advisory mandates a mandatory 5-day quarantine upon arrival in China.\n\nThis mandatory quarantine will significantly impact your trip. It will require you to spend 5 days in a designated quarantine facility upon arrival, which could disrupt your meeting schedule and overall itinerary. \n\nWe understand this is likely very disruptive news. We are exploring the options available to you.\n\nFirstly, completing the mandatory quarantine means your trip will be delayed by at least 5 days. Secondly, depending on your specific ticket and hotel booking conditions, there may be costs associated with changing or canceling your existing arrangements. These could include cancellation fees from the airline, hotel, or other services, as well as potential fare differences if we need to rebook flights for a later date. I will look into the specifics for your booking immediately.\n\nDepending on your schedule's flexibility, we could explore alternative dates for your travel. Moving your trip by at least 5 days later than originally planned in July might allow you to avoid needing to cut down the amount of days you would be able to conduct business in China. Do you have any flexibility in your travel dates? If not, we can explore alternative routes or destinations, though this would likely incur further changes in cost.\n\nI understand this is a lot to take in. I'm here to help you navigate this situation and find the best possible solution. Let's discuss your options and determine the best course of action. What are your thoughts?","estimatedTimeDelay":"5 days (due to mandatory quarantine)","advisoryId":"6980ddfcf1fe6b5076e2d328","estimatedCost":"Calculating... Will advise as soon as possible once options are identified","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"4ae07c3f-519c-4dae-b60f-6510b31f6692","name":"Flights (Logistics)","description":"Book round-trip business class flights from a major Indian city (e.g., Delhi, Mumbai) to a major Chinese city (e.g., Beijing, Shanghai) with a reputable airline like Air China or China Eastern. Consider direct flights or flights with minimal layovers to optimize travel time. Specific flight options will be confirmed based on availability and preferred airport location near intended business activity.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"8d6adfc9-95f9-46ab-9113-3133e4f950a5","name":"Airport Transfers (Logistics)","description":"Arrange private airport transfers in both India (departure city) and China (arrival city) using a premium service with a chauffeur-driven car. This ensures a smooth and comfortable transition to and from the airports. Options include black car service and private car rentals. Pre-booking is essential.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"793be6d4-ca63-41ba-8c6e-98bbeae9f210","name":"Accommodation (Hotels)","description":"Reserve a luxurious suite at a 5-star hotel in the chosen Chinese city (e.g., The Peninsula Shanghai, Four Seasons Hotel Beijing). Ensure the hotel offers business amenities such as a well-equipped business center, high-speed internet, and executive lounge access. Consider the hotel's proximity to the primary business meeting locations.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"08a62046-40f3-4383-a8ba-cd09b52df5f5","name":"Visa Processing (Docs)","description":"Initiate the Chinese visa application process well in advance. Assist with document preparation, including passport validity checks, visa application forms, invitation letters (if required), and any supporting documents. Explore expedited visa processing options to ensure timely visa acquisition. We will provide a detailed checklist of necessary documents based on the most recent consulate requirements for Indian citizens traveling to China for business.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"ca1a6243-698d-4053-a41e-a7958f15d0e4","name":"Travel Insurance (Docs)","description":"Secure comprehensive travel insurance that covers medical emergencies, trip cancellations, lost luggage, and other unforeseen events. Ensure the insurance policy covers business-related activities and provides adequate coverage for China. The policy will need to include emergency medical evacuation. Confirm the insurance provider is reputable and accessible 24/7.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"0379be81-3882-427d-8926-b4372d37b2d6","name":"Business Meeting Logistics (Key Activities)","description":"Assist with the organization and logistics of business meetings. This includes arranging meeting rooms, presentation equipment, translation services (if required), and catering. Explore potential business networking events or industry conferences relevant to the client's field. Confirm meeting schedules and locations with the client's Chinese counterparts.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"6507cf18-e3bf-4df1-9988-ec81f6b02859","name":"Cultural Immersion (Key Activities/Optional)","description":"Arrange for a private guided tour of culturally significant sites in the Chinese city (e.g., Forbidden City, Great Wall of China). Suggest a traditional Chinese dinner at a renowned restaurant. Offer opportunities to experience local culture and customs respectfully. This portion of the trip is optional but is highly encouraged to foster stronger business relationships.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"b72b79c3-1871-42d9-b33c-ed36e2009dfb","name":"Internal Transportation (Logistics)","description":"Book private transportation (car with driver) for all internal travel within the Chinese city to ensure punctuality and comfort for meetings and activities. If appropriate given destination, explore high-speed train options. Ensure any transfers between cities are smooth and efficient.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false}],"travelDate":"2026-07-01","finished":false},{"id":"217480d6-7121-4c82-a05b-f1d494a3f5d3","agentId":null,"customerName":"Executive Business Trip to China - July 2026 (Advisory Review) (Advisory Review) (Advisory Review)","customerEmail":"ishan@wyzard.ai","source":"India","destination":"China","steps":[{"id":"advisory-guidance-171587497522708","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: Cancellation and rebooking costs will vary significantly depending on the airline, fare class, and hotel policies. Without knowing these details, it's impossible to provide a precise estimate. Rebooking could range from $100-$500+, while cancellation fees could range from partial refunds to no refunds depending on the booking terms and conditions. A full cost breakdown will be provided after reviewing the specific booking details., Delay: 8 days quarantine, plus potential additional delay depending on alternative date availability.","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Travel Agent Name] from [Travel Agency Name] calling regarding your upcoming executive business trip to China scheduled for July 1st, 2026. We've just received a high-severity travel advisory that I need to bring to your immediate attention.\n\nThis advisory mandates an 8-day quarantine period upon arrival in China from India. This is a mandatory requirement, impacting all travelers regardless of vaccination status or prior test results. \n\nGiven the nature of your business trip, I understand that an 8-day quarantine would likely significantly disrupt your schedule and may even render the trip unfeasible. We want to help you explore the best options for moving forward.\n\nBefore we proceed, please understand this advisory is out of our control. Changing or canceling your booking may incur costs. These might include cancellation fees from the airline and hotels, and potentially higher fares if we need to rebook flights for different dates. I will do my best to minimize these costs and find the most cost-effective alternatives.\n\nRight now, my immediate recommendation is to explore the possibility of postponing your trip to a later date when this quarantine restriction might be lifted. Are you able to provide me with some alternative dates within July, August, or September of 2026? I can check for any potential improvements in the travel advisory and availability during those periods. This would allow us to aim for a trip that meets your business objectives while avoiding the mandatory quarantine.\n\nAlternatively, if postponing isn't feasible, we can discuss options for a full cancellation, understanding that cancellation fees may apply. I will gather all relevant information on potential fees and alternative dates for you to consider before you make a decision. Could we please schedule a brief follow-up call within the next 24 hours to discuss these options in detail?\n\nThank you for your understanding, and I apologize for any inconvenience this unforeseen advisory may cause. We value your business and will do everything we can to assist you.","advisoryId":"6980de44f1fe6b5076e2d329","estimatedTimeDelay":"8 days quarantine, plus potential additional delay depending on alternative date availability.","estimatedCost":"Cancellation and rebooking costs will vary significantly depending on the airline, fare class, and hotel policies. Without knowing these details, it's impossible to provide a precise estimate. Rebooking could range from $100-$500+, while cancellation fees could range from partial refunds to no refunds depending on the booking terms and conditions. A full cost breakdown will be provided after reviewing the specific booking details.","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"9f6d5125-4550-40f6-b230-485db8ae4f4d","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: Dependent on chosen option. Cancellation fees typically range from $100 to $500, and fare differences can vary widely. A detailed cost breakdown will be provided after selecting an option., Delay: 5 days, if proceeding with the original plan.","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Travel Agent Name] calling from [Travel Agency Name] regarding your upcoming business trip to China on July 1st, 2026.\n\nWe've just received a high-severity travel advisory from [Authority Name] impacting travel from India to China, and it directly affects your booking. The advisory mandates a 5-day quarantine period upon arrival in China.\n\nThis means that upon arrival in China, you will be required to quarantine in a designated facility for five full days before you can proceed with your business activities. This could significantly impact your schedule and the purpose of your trip.\n\nBefore we proceed I want to let you know that your safety and well-being are my top priority. \n\nSeveral options are available to you, and I want to take the time to explore them with you to make the best decision possible. First, we could keep your itinerary as is, but factor in the 5-day quarantine period. We could look at pushing the trip back to later in July, or even August, in the hopes that the advisory will be lifted or amended. Or we could look at rerouting your trip if the China portion is not absolutely essential.\n\nPlease be aware that changing your travel dates or rerouting your trip may incur additional costs. Depending on the airline's policies and the fare class of your ticket, there may be cancellation or change fees. Rebooking for later dates could also result in higher airfares and potentially different hotel rates. I will need to investigate these costs specifically related to your booking once we decide on the best course of action.\n\nLet’s discuss your priorities for this trip. Is the timing flexible? Is the meeting location set in stone? Understanding your needs will help me find the most suitable solution. We will explore all available options, including potential waivers due to the circumstances, to minimize any financial impact.\n\nWhat would you like to do?","estimatedTimeDelay":"5 days, if proceeding with the original plan.","advisoryId":"6980ddfcf1fe6b5076e2d328","estimatedCost":"Dependent on chosen option. Cancellation fees typically range from $100 to $500, and fare differences can vary widely. A detailed cost breakdown will be provided after selecting an option.","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"26c75779-b647-4753-92e8-979b9ae71ae4","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: $500, Delay: 5 days","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Travel Agent Name] calling from [Travel Agency]. I'm calling with an urgent update regarding your upcoming business trip to China on July 1st, 2026.\n\nA new travel advisory has just been issued by [Source - e.g., health organization, government], and it's classified as HIGH severity. This advisory mandates a mandatory 5-day quarantine upon arrival in China from India. This means you will be required to isolate in a designated facility, or possibly your hotel room, for five days immediately upon arrival. \n\nI understand this will significantly impact your trip's schedule. Essentially, you'll lose five days of productive business time. The quarantine will involve strict protocols, including daily health checks, limited contact with others, and adherence to the facility’s regulations. This could influence the success of your business objectives in China. \n\nDepending on your hotel and other pre-booked arrangements, there may be costs associated with either modifying or cancelling those reservations. Similarly, changing your flight dates might incur change fees, or result in increased fare costs due to potential price fluctuations. Let me quickly check on the potential cost implications associated with these changes. (Pause to check system). Okay, I am seeing potential change fees of approximately [Estimated Fee Amount] for rescheduling the flights and [Estimated Fee Amount] for the changes to hotel and other pre-booked items, depending on the chosen new dates. These are, of course, preliminary and subject to availability.\n\nGiven the mandatory quarantine, would you consider postponing your trip by at least five days, perhaps to start your travel on or after July 6th? This would allow you to complete the quarantine period before starting your business activities. Alternatively, we could explore alternative destinations that do not currently have quarantine requirements if the timing of your trip is flexible and your business objectives can be achieved elsewhere. I will email you alternative dates and destination options with estimated price. Let me know if you have any questions or concerns.","estimatedTimeDelay":"5 days","advisoryId":"6980d91cf1fe6b5076e2d327","estimatedCost":"$500","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"72d8f9a9-bc33-43d0-8804-debd4441f4e3","name":"Flights (Logistics)","description":"Book round-trip business class flights from a major Indian city (e.g., Delhi, Mumbai) to a major Chinese city (e.g., Beijing, Shanghai) with a reputable airline like Air China or China Eastern. Consider direct flights or flights with minimal layovers to optimize travel time. Specific flight options will be confirmed based on availability and preferred airport location near intended business activity.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"e2c6beba-4c32-4a70-bede-ac7236937eb4","name":"Airport Transfers (Logistics)","description":"Arrange private airport transfers in both India (departure city) and China (arrival city) using a premium service with a chauffeur-driven car. This ensures a smooth and comfortable transition to and from the airports. Options include black car service and private car rentals. Pre-booking is essential.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"46586ea8-903a-4264-836a-d1123ee92b68","name":"Accommodation (Hotels)","description":"Reserve a luxurious suite at a 5-star hotel in the chosen Chinese city (e.g., The Peninsula Shanghai, Four Seasons Hotel Beijing). Ensure the hotel offers business amenities such as a well-equipped business center, high-speed internet, and executive lounge access. Consider the hotel's proximity to the primary business meeting locations.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"41a7db56-b581-4738-9c1b-5af93adb754b","name":"Visa Processing (Docs)","description":"Initiate the Chinese visa application process well in advance. Assist with document preparation, including passport validity checks, visa application forms, invitation letters (if required), and any supporting documents. Explore expedited visa processing options to ensure timely visa acquisition. We will provide a detailed checklist of necessary documents based on the most recent consulate requirements for Indian citizens traveling to China for business.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"efc22dc0-f966-4088-af23-5bbc683185b6","name":"Travel Insurance (Docs)","description":"Secure comprehensive travel insurance that covers medical emergencies, trip cancellations, lost luggage, and other unforeseen events. Ensure the insurance policy covers business-related activities and provides adequate coverage for China. The policy will need to include emergency medical evacuation. Confirm the insurance provider is reputable and accessible 24/7.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"c01ff78b-2b6a-4d20-92e9-3efb374a2823","name":"Business Meeting Logistics (Key Activities)","description":"Assist with the organization and logistics of business meetings. This includes arranging meeting rooms, presentation equipment, translation services (if required), and catering. Explore potential business networking events or industry conferences relevant to the client's field. Confirm meeting schedules and locations with the client's Chinese counterparts.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"b73d3d41-7e2a-46c8-bf04-efc5821d53f9","name":"Cultural Immersion (Key Activities/Optional)","description":"Arrange for a private guided tour of culturally significant sites in the Chinese city (e.g., Forbidden City, Great Wall of China). Suggest a traditional Chinese dinner at a renowned restaurant. Offer opportunities to experience local culture and customs respectfully. This portion of the trip is optional but is highly encouraged to foster stronger business relationships.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"2f6c171b-233d-4256-92bc-a108202153a4","name":"Internal Transportation (Logistics)","description":"Book private transportation (car with driver) for all internal travel within the Chinese city to ensure punctuality and comfort for meetings and activities. If appropriate given destination, explore high-speed train options. Ensure any transfers between cities are smooth and efficient.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false}],"travelDate":"2026-07-01","finished":false},{"id":"8e6191e2-5285-4f8e-8922-c01d49a09b2d","agentId":null,"customerName":"Executive Business Trip to China - July 2026 (Advisory Review)","customerEmail":"ishan@wyzard.ai","source":"India","destination":"China","steps":[{"id":"advisory-guidance-171659425411666","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: $0 (depending on the customer's decision on whether or not to re-book), Delay: 2 days","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Travel Agent Name] from [Travel Agency]. I'm calling you regarding your upcoming business trip to China on July 1st, 2026.\n\nI'm afraid I have some urgent news. A new travel advisory has just been issued for travel from India to China, and it’s classified as HIGH severity. This means there are significant implications for your trip.\n\nSpecifically, the advisory mandates a mandatory quarantine period of 2 days upon arrival in China. This means that upon landing, you will be required to stay at a designated facility for 48 hours before you are allowed to continue your travels. \n\nI understand this is likely disruptive, especially given the nature of a business trip. This quarantine will impact your schedule and potentially affect meeting timelines. We need to discuss your options as soon as possible.\n\nBefore we proceed, please note that any changes to your booking, depending on the fare class and airline policies, might incur cancellation or change fees. Also, rebooking for a different date could potentially result in higher fares depending on availability. Let me check on that. I can explore possible options for you now. Would you like me to look into potential options to move your trip? For example, can we discuss moving your travel date back a few days to allow more flexibility or potentially adjusting your itinerary to minimize disruption? Or are you planning on taking the trip anyway?\n\nI will do my best to find the most cost-effective and convenient solution for you. Please let me know your preference so that I can start assisting you.","advisoryId":"6980deaaf1fe6b5076e2d32a","estimatedTimeDelay":"2 days","estimatedCost":"$0 (depending on the customer's decision on whether or not to re-book)","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"802df7e7-a135-4a99-8ccd-aa7a645f7620","name":"Flights (Logistics)","description":"Book round-trip business class flights from a major Indian city (e.g., Delhi, Mumbai) to a major Chinese city (e.g., Beijing, Shanghai) with a reputable airline like Air China or China Eastern. Consider direct flights or flights with minimal layovers to optimize travel time. Specific flight options will be confirmed based on availability and preferred airport location near intended business activity.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"fece73b4-8804-44de-b7f1-8baf5e1b381b","name":"Airport Transfers (Logistics)","description":"Arrange private airport transfers in both India (departure city) and China (arrival city) using a premium service with a chauffeur-driven car. This ensures a smooth and comfortable transition to and from the airports. Options include black car service and private car rentals. Pre-booking is essential.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"6985bbce-7330-4ca4-b04e-6ac2e7bcf140","name":"Accommodation (Hotels)","description":"Reserve a luxurious suite at a 5-star hotel in the chosen Chinese city (e.g., The Peninsula Shanghai, Four Seasons Hotel Beijing). Ensure the hotel offers business amenities such as a well-equipped business center, high-speed internet, and executive lounge access. Consider the hotel's proximity to the primary business meeting locations.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"2aa1c6df-5d51-437e-825f-551b765996c3","name":"Visa Processing (Docs)","description":"Initiate the Chinese visa application process well in advance. Assist with document preparation, including passport validity checks, visa application forms, invitation letters (if required), and any supporting documents. Explore expedited visa processing options to ensure timely visa acquisition. We will provide a detailed checklist of necessary documents based on the most recent consulate requirements for Indian citizens traveling to China for business.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"188c22b4-0ce7-4ca8-b53a-2505d28bb611","name":"Travel Insurance (Docs)","description":"Secure comprehensive travel insurance that covers medical emergencies, trip cancellations, lost luggage, and other unforeseen events. Ensure the insurance policy covers business-related activities and provides adequate coverage for China. The policy will need to include emergency medical evacuation. Confirm the insurance provider is reputable and accessible 24/7.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"388b836c-827d-41c4-913d-bffe851ffd05","name":"Business Meeting Logistics (Key Activities)","description":"Assist with the organization and logistics of business meetings. This includes arranging meeting rooms, presentation equipment, translation services (if required), and catering. Explore potential business networking events or industry conferences relevant to the client's field. Confirm meeting schedules and locations with the client's Chinese counterparts.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"b8c5a8e9-a033-4708-90a9-54f19bdcd4cb","name":"Cultural Immersion (Key Activities/Optional)","description":"Arrange for a private guided tour of culturally significant sites in the Chinese city (e.g., Forbidden City, Great Wall of China). Suggest a traditional Chinese dinner at a renowned restaurant. Offer opportunities to experience local culture and customs respectfully. This portion of the trip is optional but is highly encouraged to foster stronger business relationships.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"f8d8f71e-cc22-41e8-bb27-a2cb6f9bb215","name":"Internal Transportation (Logistics)","description":"Book private transportation (car with driver) for all internal travel within the Chinese city to ensure punctuality and comfort for meetings and activities. If appropriate given destination, explore high-speed train options. Ensure any transfers between cities are smooth and efficient.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false}],"travelDate":"2026-07-01","finished":false},{"id":"70f082a9-b24c-4080-ac0f-86c7f2fe8170","agentId":null,"customerName":"Executive Business Trip to China - July 2026 (Advisory Review) (Advisory Review)","customerEmail":"ishan@wyzard.ai","source":"India","destination":"China","steps":[{"id":"advisory-guidance-171666277034833","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: $0-500 (This is a broad estimate. Actual cost will vary greatly depending on fare class, airline, hotel, and time of booking change. A detailed cost breakdown will be provided upon exploring specific options.), Delay: 2 days (minimum, due to quarantine). Additional delays may occur due to rescheduling flight availability.","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon, [Customer Name]. This is [Travel Agent Name] from [Travel Agency Name] regarding your upcoming business trip to China on July 1st, 2026. I'm calling you with some urgent news regarding a newly issued travel advisory that significantly impacts your travel plans.\n\nA HIGH severity advisory has been issued for travel between India and China. This advisory mandates a mandatory 2-day quarantine upon arrival in China. I understand this is likely to significantly disrupt your business schedule.\n\nThis mandatory quarantine will affect your itinerary. You will need to factor in these 2 days for quarantine upon arrival. This may impact any meetings or events planned for the first two days of your trip.\n\nThere are several options we can explore. Firstly, we can proceed with the original booking, understanding that you will need to comply with the quarantine requirements. Secondly, we can explore alternative travel dates, potentially pushing your trip back to allow more buffer time, or, if possible, moving it forward if the quarantine regulations are expected to change (though there's no guarantee of that). Finally, we could consider rerouting, although given the nature of your business trip, that may not be feasible. The cost of rerouting to another location may include penalties or cancellation fees depending on the airline and hotels. Delaying the trip could mean increased airline and hotel costs, especially given the fluctuating nature of travel fares. We will review the cost impact before confirming any changes.\n\nCould you please provide a short overview of how critical the first two days of your trip are, so that we can find the best available option for you?","advisoryId":"6980deaaf1fe6b5076e2d32a","estimatedTimeDelay":"2 days (minimum, due to quarantine). Additional delays may occur due to rescheduling flight availability.","estimatedCost":"$0-500 (This is a broad estimate. Actual cost will vary greatly depending on fare class, airline, hotel, and time of booking change. A detailed cost breakdown will be provided upon exploring specific options.)","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"9ec38934-ed55-4fa1-a81d-f5ee7affc8bb","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: $500, Delay: 5 days","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Travel Agent Name] calling from [Travel Agency]. I'm calling with an urgent update regarding your upcoming business trip to China on July 1st, 2026.\n\nA new travel advisory has just been issued by [Source - e.g., health organization, government], and it's classified as HIGH severity. This advisory mandates a mandatory 5-day quarantine upon arrival in China from India. This means you will be required to isolate in a designated facility, or possibly your hotel room, for five days immediately upon arrival. \n\nI understand this will significantly impact your trip's schedule. Essentially, you'll lose five days of productive business time. The quarantine will involve strict protocols, including daily health checks, limited contact with others, and adherence to the facility’s regulations. This could influence the success of your business objectives in China. \n\nDepending on your hotel and other pre-booked arrangements, there may be costs associated with either modifying or cancelling those reservations. Similarly, changing your flight dates might incur change fees, or result in increased fare costs due to potential price fluctuations. Let me quickly check on the potential cost implications associated with these changes. (Pause to check system). Okay, I am seeing potential change fees of approximately [Estimated Fee Amount] for rescheduling the flights and [Estimated Fee Amount] for the changes to hotel and other pre-booked items, depending on the chosen new dates. These are, of course, preliminary and subject to availability.\n\nGiven the mandatory quarantine, would you consider postponing your trip by at least five days, perhaps to start your travel on or after July 6th? This would allow you to complete the quarantine period before starting your business activities. Alternatively, we could explore alternative destinations that do not currently have quarantine requirements if the timing of your trip is flexible and your business objectives can be achieved elsewhere. I will email you alternative dates and destination options with estimated price. Let me know if you have any questions or concerns.","estimatedTimeDelay":"5 days","advisoryId":"6980d91cf1fe6b5076e2d327","estimatedCost":"$500","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"26f0113d-9819-4c93-916d-eed528a921f3","name":"Flights (Logistics)","description":"Book round-trip business class flights from a major Indian city (e.g., Delhi, Mumbai) to a major Chinese city (e.g., Beijing, Shanghai) with a reputable airline like Air China or China Eastern. Consider direct flights or flights with minimal layovers to optimize travel time. Specific flight options will be confirmed based on availability and preferred airport location near intended business activity.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"c1ae8ef2-ba76-4997-a07d-57fe4c0ec02f","name":"Airport Transfers (Logistics)","description":"Arrange private airport transfers in both India (departure city) and China (arrival city) using a premium service with a chauffeur-driven car. This ensures a smooth and comfortable transition to and from the airports. Options include black car service and private car rentals. Pre-booking is essential.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"0a0dfc12-bfa0-4956-987f-db818f7f0d09","name":"Accommodation (Hotels)","description":"Reserve a luxurious suite at a 5-star hotel in the chosen Chinese city (e.g., The Peninsula Shanghai, Four Seasons Hotel Beijing). Ensure the hotel offers business amenities such as a well-equipped business center, high-speed internet, and executive lounge access. Consider the hotel's proximity to the primary business meeting locations.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"3efbaa15-424e-4b10-8a47-9126755c377e","name":"Visa Processing (Docs)","description":"Initiate the Chinese visa application process well in advance. Assist with document preparation, including passport validity checks, visa application forms, invitation letters (if required), and any supporting documents. Explore expedited visa processing options to ensure timely visa acquisition. We will provide a detailed checklist of necessary documents based on the most recent consulate requirements for Indian citizens traveling to China for business.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"92035e10-922a-4616-b49d-05352371743f","name":"Travel Insurance (Docs)","description":"Secure comprehensive travel insurance that covers medical emergencies, trip cancellations, lost luggage, and other unforeseen events. Ensure the insurance policy covers business-related activities and provides adequate coverage for China. The policy will need to include emergency medical evacuation. Confirm the insurance provider is reputable and accessible 24/7.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"c57658d1-13de-41e0-b6ac-17209d5b47ed","name":"Business Meeting Logistics (Key Activities)","description":"Assist with the organization and logistics of business meetings. This includes arranging meeting rooms, presentation equipment, translation services (if required), and catering. Explore potential business networking events or industry conferences relevant to the client's field. Confirm meeting schedules and locations with the client's Chinese counterparts.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"553db4e9-5d0c-43e6-95ef-eace4b3509dd","name":"Cultural Immersion (Key Activities/Optional)","description":"Arrange for a private guided tour of culturally significant sites in the Chinese city (e.g., Forbidden City, Great Wall of China). Suggest a traditional Chinese dinner at a renowned restaurant. Offer opportunities to experience local culture and customs respectfully. This portion of the trip is optional but is highly encouraged to foster stronger business relationships.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"73e22152-5c12-4958-abad-d6ef72cc3624","name":"Internal Transportation (Logistics)","description":"Book private transportation (car with driver) for all internal travel within the Chinese city to ensure punctuality and comfort for meetings and activities. If appropriate given destination, explore high-speed train options. Ensure any transfers between cities are smooth and efficient.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false}],"travelDate":"2026-07-01","finished":false},{"id":"5daa97b8-25fe-47e5-9288-a4cd895db7a0","agentId":null,"customerName":"Executive Business Trip to China - July 2026 (Advisory Review)","customerEmail":"ishan@wyzard.ai","source":"India","destination":"China","steps":[{"id":"advisory-guidance-171782087114624","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: $500 (Potential Cancellation or Change Fees - Subject to specific airline and hotel policies and availability), Delay: 2 days (if proceeding with original itinerary)","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Your Name] from [Travel Agency]. I'm calling regarding your upcoming executive business trip to China scheduled for July 1st, 2026. \n\nI'm afraid I have some urgent news regarding a newly issued travel advisory for travel between India and China. This is a HIGH severity advisory, meaning it has significant implications for your trip. \n\nThe advisory mandates a mandatory 2-day quarantine upon arrival in China. This will significantly impact your itinerary and require you to isolate for the first 48 hours. \n\nThis quarantine could affect your scheduled meetings and activities. We need to discuss your options as soon as possible. These options might include:\n\n*   **Proceeding with the trip:** You would need to factor in the 2-day quarantine into your schedule. We can assist you with pre-booking an approved quarantine hotel to make the process smoother. However, be aware that the 2-day quarantine is mandatory, regardless of vaccination status or negative COVID-19 test results. \n*   **Rescheduling your trip:** Depending on the flexibility of your meetings, we could look at postponing your trip to a later date, hoping the advisory might be lifted or lessened by then. July and August are especially popular so it may come at a premium. \n*   **Modifying your itinerary:** Depending on the purpose of your trip, we could explore alternative destinations within China that might not be subject to the same stringent quarantine requirements. We can discuss this further if it's a possibility.\n*   **Cancellation:** You have the option to cancel the trip entirely. However, please be aware that depending on the airline and hotel policies, cancellation fees may apply. We will, of course, work to minimize these fees where possible.\n\nBefore we make any decisions, let's discuss the following:\n\n*   The flexibility of your meeting schedule in China.\n*   Your willingness to undergo the 2-day quarantine.\n*   Any alternative destinations that might be suitable.\n\nWe need to act quickly to mitigate potential financial losses and minimize disruption to your travel plans. Please let me know what time you are available to discuss this further, preferably within the next few hours. We can then explore the best course of action for you. I understand this is unsettling news, and I apologize for any inconvenience this may cause. We are here to help you navigate this situation.","advisoryId":"6980df2221aa202038f77787","estimatedTimeDelay":"2 days (if proceeding with original itinerary)","estimatedCost":"$500 (Potential Cancellation or Change Fees - Subject to specific airline and hotel policies and availability)","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"8cc9fd16-0bff-4956-afb0-ba17e3f6706a","name":"Flights (Logistics)","description":"Book round-trip business class flights from a major Indian city (e.g., Delhi, Mumbai) to a major Chinese city (e.g., Beijing, Shanghai) with a reputable airline like Air China or China Eastern. Consider direct flights or flights with minimal layovers to optimize travel time. Specific flight options will be confirmed based on availability and preferred airport location near intended business activity.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"defa9846-da3c-4d6a-add6-5a3ec28f349f","name":"Airport Transfers (Logistics)","description":"Arrange private airport transfers in both India (departure city) and China (arrival city) using a premium service with a chauffeur-driven car. This ensures a smooth and comfortable transition to and from the airports. Options include black car service and private car rentals. Pre-booking is essential.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"ab0e4c2c-6d99-4134-84b4-6b624e647032","name":"Accommodation (Hotels)","description":"Reserve a luxurious suite at a 5-star hotel in the chosen Chinese city (e.g., The Peninsula Shanghai, Four Seasons Hotel Beijing). Ensure the hotel offers business amenities such as a well-equipped business center, high-speed internet, and executive lounge access. Consider the hotel's proximity to the primary business meeting locations.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"0d5eb71f-57ab-4d68-8a7e-19537a6de358","name":"Visa Processing (Docs)","description":"Initiate the Chinese visa application process well in advance. Assist with document preparation, including passport validity checks, visa application forms, invitation letters (if required), and any supporting documents. Explore expedited visa processing options to ensure timely visa acquisition. We will provide a detailed checklist of necessary documents based on the most recent consulate requirements for Indian citizens traveling to China for business.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"0ec04e9a-890b-4153-a97b-d634c1b67c29","name":"Travel Insurance (Docs)","description":"Secure comprehensive travel insurance that covers medical emergencies, trip cancellations, lost luggage, and other unforeseen events. Ensure the insurance policy covers business-related activities and provides adequate coverage for China. The policy will need to include emergency medical evacuation. Confirm the insurance provider is reputable and accessible 24/7.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"65459d9f-9d49-4654-b28e-2ced94d3e70a","name":"Business Meeting Logistics (Key Activities)","description":"Assist with the organization and logistics of business meetings. This includes arranging meeting rooms, presentation equipment, translation services (if required), and catering. Explore potential business networking events or industry conferences relevant to the client's field. Confirm meeting schedules and locations with the client's Chinese counterparts.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"c76aea51-252e-45b1-b6e7-8d38c9b844a4","name":"Cultural Immersion (Key Activities/Optional)","description":"Arrange for a private guided tour of culturally significant sites in the Chinese city (e.g., Forbidden City, Great Wall of China). Suggest a traditional Chinese dinner at a renowned restaurant. Offer opportunities to experience local culture and customs respectfully. This portion of the trip is optional but is highly encouraged to foster stronger business relationships.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"fd9ae891-76dd-4b1a-9f02-b1ca5069f8c0","name":"Internal Transportation (Logistics)","description":"Book private transportation (car with driver) for all internal travel within the Chinese city to ensure punctuality and comfort for meetings and activities. If appropriate given destination, explore high-speed train options. Ensure any transfers between cities are smooth and efficient.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false}],"travelDate":"2026-07-01","finished":false},{"id":"787b270d-766f-477e-98f8-36a7d54f0a8f","agentId":null,"customerName":"Executive Business Trip to China - July 2026 (Advisory Review) (Advisory Review)","customerEmail":"ishan@wyzard.ai","source":"India","destination":"China","steps":[{"id":"advisory-guidance-171793227772208","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: $200 - $1000+, Delay: 2 days","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Travel Agent Name] calling from [Travel Agency Name] regarding your upcoming business trip to China on July 1st, 2026. We've just received a high-severity travel advisory from the Indian and Chinese authorities that directly impacts your booking. \n\nEffective immediately, all travelers arriving in China from India are now required to undergo a mandatory 2-day quarantine upon arrival. This means you will need to spend 2 days in a designated facility before you can begin your business meetings or activities. \n\nI understand this is likely very disruptive, especially for a business trip. This quarantine period will impact your schedule, potentially delaying planned meetings and activities. I want to assure you that we are doing everything we can to help you navigate this situation. \n\nThere are a few options we can explore:\n\n*   **Proceed with the current booking:** Accept the 2-day quarantine upon arrival. We can assist with confirming the quarantine facility details and any associated costs if they are not covered by the local authorities. However, this will delay the start of your business activities.\n*   **Reschedule your trip:** We can explore alternative dates later in July or August 2026, hoping the advisory will be lifted or modified. However, future travel advisories can change without notice.\n*   **Reroute your trip (If applicable):** If your business allows, we can explore rerouting to a different destination that doesn't have these restrictions. This would involve significant changes to your itinerary and could incur cancellation fees for the China portion of your trip.\n\nI need to inform you that depending on which airline and hotel you've booked, cancelling or modifying your flights and accommodation could incur cancellation fees. Furthermore, fares for alternative dates or destinations can fluctuate, potentially leading to increased costs.  We can provide you with a detailed breakdown of these potential costs once we explore your options.\n\nGiven the high severity of this advisory and the significant impact of a 2-day quarantine on your business trip, I strongly advise that we discuss these options as soon as possible. Please let me know what time would be convenient for you to discuss this in more detail, or if you'd like me to immediately investigate the cost implications of rescheduling or rerouting. We want to find the best solution for you under these challenging circumstances.","advisoryId":"6980df2221aa202038f77787","estimatedTimeDelay":"2 days","estimatedCost":"$200 - $1000+","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"9943369c-8c9b-48d0-a87f-c6ccdb278dbf","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: $500, Delay: 5 days","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Travel Agent Name] calling from [Travel Agency]. I'm calling with an urgent update regarding your upcoming business trip to China on July 1st, 2026.\n\nA new travel advisory has just been issued by [Source - e.g., health organization, government], and it's classified as HIGH severity. This advisory mandates a mandatory 5-day quarantine upon arrival in China from India. This means you will be required to isolate in a designated facility, or possibly your hotel room, for five days immediately upon arrival. \n\nI understand this will significantly impact your trip's schedule. Essentially, you'll lose five days of productive business time. The quarantine will involve strict protocols, including daily health checks, limited contact with others, and adherence to the facility’s regulations. This could influence the success of your business objectives in China. \n\nDepending on your hotel and other pre-booked arrangements, there may be costs associated with either modifying or cancelling those reservations. Similarly, changing your flight dates might incur change fees, or result in increased fare costs due to potential price fluctuations. Let me quickly check on the potential cost implications associated with these changes. (Pause to check system). Okay, I am seeing potential change fees of approximately [Estimated Fee Amount] for rescheduling the flights and [Estimated Fee Amount] for the changes to hotel and other pre-booked items, depending on the chosen new dates. These are, of course, preliminary and subject to availability.\n\nGiven the mandatory quarantine, would you consider postponing your trip by at least five days, perhaps to start your travel on or after July 6th? This would allow you to complete the quarantine period before starting your business activities. Alternatively, we could explore alternative destinations that do not currently have quarantine requirements if the timing of your trip is flexible and your business objectives can be achieved elsewhere. I will email you alternative dates and destination options with estimated price. Let me know if you have any questions or concerns.","estimatedTimeDelay":"5 days","advisoryId":"6980d91cf1fe6b5076e2d327","estimatedCost":"$500","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"3302af93-f751-484d-8be3-bd4e0f9b9e47","name":"Flights (Logistics)","description":"Book round-trip business class flights from a major Indian city (e.g., Delhi, Mumbai) to a major Chinese city (e.g., Beijing, Shanghai) with a reputable airline like Air China or China Eastern. Consider direct flights or flights with minimal layovers to optimize travel time. Specific flight options will be confirmed based on availability and preferred airport location near intended business activity.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"c0eb9b12-8b4a-4391-8ed0-6620d108787e","name":"Airport Transfers (Logistics)","description":"Arrange private airport transfers in both India (departure city) and China (arrival city) using a premium service with a chauffeur-driven car. This ensures a smooth and comfortable transition to and from the airports. Options include black car service and private car rentals. Pre-booking is essential.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"a9605482-642f-496c-b846-499fdbde93f4","name":"Accommodation (Hotels)","description":"Reserve a luxurious suite at a 5-star hotel in the chosen Chinese city (e.g., The Peninsula Shanghai, Four Seasons Hotel Beijing). Ensure the hotel offers business amenities such as a well-equipped business center, high-speed internet, and executive lounge access. Consider the hotel's proximity to the primary business meeting locations.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"3bea1955-9852-46a6-96c0-0b53774eb47a","name":"Visa Processing (Docs)","description":"Initiate the Chinese visa application process well in advance. Assist with document preparation, including passport validity checks, visa application forms, invitation letters (if required), and any supporting documents. Explore expedited visa processing options to ensure timely visa acquisition. We will provide a detailed checklist of necessary documents based on the most recent consulate requirements for Indian citizens traveling to China for business.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"d5381217-6f84-4b28-b81c-5241a391654a","name":"Travel Insurance (Docs)","description":"Secure comprehensive travel insurance that covers medical emergencies, trip cancellations, lost luggage, and other unforeseen events. Ensure the insurance policy covers business-related activities and provides adequate coverage for China. The policy will need to include emergency medical evacuation. Confirm the insurance provider is reputable and accessible 24/7.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"f56d4fda-40e6-4d66-9ad6-87347356586a","name":"Business Meeting Logistics (Key Activities)","description":"Assist with the organization and logistics of business meetings. This includes arranging meeting rooms, presentation equipment, translation services (if required), and catering. Explore potential business networking events or industry conferences relevant to the client's field. Confirm meeting schedules and locations with the client's Chinese counterparts.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"5303d962-381c-4659-9740-8246cb482248","name":"Cultural Immersion (Key Activities/Optional)","description":"Arrange for a private guided tour of culturally significant sites in the Chinese city (e.g., Forbidden City, Great Wall of China). Suggest a traditional Chinese dinner at a renowned restaurant. Offer opportunities to experience local culture and customs respectfully. This portion of the trip is optional but is highly encouraged to foster stronger business relationships.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"f48360ba-b1d3-43a0-aa12-12e8b52db053","name":"Internal Transportation (Logistics)","description":"Book private transportation (car with driver) for all internal travel within the Chinese city to ensure punctuality and comfort for meetings and activities. If appropriate given destination, explore high-speed train options. Ensure any transfers between cities are smooth and efficient.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false}],"travelDate":"2026-07-01","finished":false},{"id":"0db8fed9-d3d4-4cff-b8f4-da5c45324009","agentId":null,"customerName":"Executive Business Trip to China - July 2026 (Advisory Review) (Advisory Review)","customerEmail":"ishan@wyzard.ai","source":"India","destination":"China","steps":[{"id":"advisory-guidance-171801913892166","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: This will depend greatly on the type of ticket you have, the hotel booking, and the change fees. I will need to search for alternatives to give you an estimated cost., Delay: 2 days (mandatory quarantine)","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Travel Agent Name] calling from [Travel Agency Name] regarding your upcoming business trip to China on July 1st, 2026.  I'm calling with some urgent news regarding a newly issued travel advisory that directly impacts your booking.  The advisory is classified as HIGH severity. It mandates a mandatory 2-day quarantine upon arrival in China for all travelers from India.\n\nThis means you'll need to factor in an additional 2 days of mandatory quarantine at a designated facility upon arrival. This will obviously impact your itinerary and potentially the meetings you have scheduled.  We understand this is likely very disruptive, and we are doing everything we can to help you navigate this situation.\n\nBefore we discuss options, I want to be clear about potential implications. Changing your travel dates or destination could incur cancellation fees depending on the fare rules of your current ticket. Rescheduling flights often results in higher fares, and any changes to hotel bookings might also carry penalties. We will, of course, do our best to minimize these costs.\n\nGiven the mandatory quarantine, the most straightforward solutions would be to:\n\n1.  **Reschedule your trip to a later date:**  Perhaps delaying your trip by a few days or weeks after factoring in the mandatory quarantine. We can explore availability and pricing for alternative dates.\n2.  **Consider alternative destinations:** Depending on the purpose of your trip and the feasibility, we could look at other locations that might fulfill your business needs without the quarantine requirement.\n\nI understand this is unwelcome news.  Let's discuss your priorities and constraints. What are your thoughts on these options?  Are there any specific meeting dates that are non-negotiable, or any flexibility in the purpose of the trip that would allow us to explore alternative destinations?  We can then begin checking availability and associated costs for changes.  Let's work together to find the best possible solution given these new circumstances.","advisoryId":"6980df2221aa202038f77787","estimatedTimeDelay":"2 days (mandatory quarantine)","estimatedCost":"This will depend greatly on the type of ticket you have, the hotel booking, and the change fees. I will need to search for alternatives to give you an estimated cost.","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"94d5cc41-1c43-4442-8374-35f71c9f06f4","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: Calculating... Will advise as soon as possible once options are identified, Delay: 5 days (due to mandatory quarantine)","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Travel Agent Name] from [Travel Agency Name]. I'm calling regarding your upcoming business trip to China on July 1st, 2026.\n\nA new travel advisory has just been issued for travel from India to China, and unfortunately, it's classified as HIGH severity. This means there's a significant change impacting your travel plans. The advisory mandates a mandatory 5-day quarantine upon arrival in China.\n\nThis mandatory quarantine will significantly impact your trip. It will require you to spend 5 days in a designated quarantine facility upon arrival, which could disrupt your meeting schedule and overall itinerary. \n\nWe understand this is likely very disruptive news. We are exploring the options available to you.\n\nFirstly, completing the mandatory quarantine means your trip will be delayed by at least 5 days. Secondly, depending on your specific ticket and hotel booking conditions, there may be costs associated with changing or canceling your existing arrangements. These could include cancellation fees from the airline, hotel, or other services, as well as potential fare differences if we need to rebook flights for a later date. I will look into the specifics for your booking immediately.\n\nDepending on your schedule's flexibility, we could explore alternative dates for your travel. Moving your trip by at least 5 days later than originally planned in July might allow you to avoid needing to cut down the amount of days you would be able to conduct business in China. Do you have any flexibility in your travel dates? If not, we can explore alternative routes or destinations, though this would likely incur further changes in cost.\n\nI understand this is a lot to take in. I'm here to help you navigate this situation and find the best possible solution. Let's discuss your options and determine the best course of action. What are your thoughts?","estimatedTimeDelay":"5 days (due to mandatory quarantine)","advisoryId":"6980ddfcf1fe6b5076e2d328","estimatedCost":"Calculating... Will advise as soon as possible once options are identified","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"1110d38d-c07c-427f-a32f-e588f9d00320","name":"Flights (Logistics)","description":"Book round-trip business class flights from a major Indian city (e.g., Delhi, Mumbai) to a major Chinese city (e.g., Beijing, Shanghai) with a reputable airline like Air China or China Eastern. Consider direct flights or flights with minimal layovers to optimize travel time. Specific flight options will be confirmed based on availability and preferred airport location near intended business activity.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"d0268ea0-d8e2-4243-b0d3-717413504383","name":"Airport Transfers (Logistics)","description":"Arrange private airport transfers in both India (departure city) and China (arrival city) using a premium service with a chauffeur-driven car. This ensures a smooth and comfortable transition to and from the airports. Options include black car service and private car rentals. Pre-booking is essential.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"774faafb-a941-45a1-8eab-36cc973d3578","name":"Accommodation (Hotels)","description":"Reserve a luxurious suite at a 5-star hotel in the chosen Chinese city (e.g., The Peninsula Shanghai, Four Seasons Hotel Beijing). Ensure the hotel offers business amenities such as a well-equipped business center, high-speed internet, and executive lounge access. Consider the hotel's proximity to the primary business meeting locations.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"2390f0cf-b0cb-4ed4-ac69-173107cbc68e","name":"Visa Processing (Docs)","description":"Initiate the Chinese visa application process well in advance. Assist with document preparation, including passport validity checks, visa application forms, invitation letters (if required), and any supporting documents. Explore expedited visa processing options to ensure timely visa acquisition. We will provide a detailed checklist of necessary documents based on the most recent consulate requirements for Indian citizens traveling to China for business.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"c0304568-57a2-4d29-bb2f-40aa18d32887","name":"Travel Insurance (Docs)","description":"Secure comprehensive travel insurance that covers medical emergencies, trip cancellations, lost luggage, and other unforeseen events. Ensure the insurance policy covers business-related activities and provides adequate coverage for China. The policy will need to include emergency medical evacuation. Confirm the insurance provider is reputable and accessible 24/7.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"25e5c6d8-ba51-49ab-9882-64b6447b0ff0","name":"Business Meeting Logistics (Key Activities)","description":"Assist with the organization and logistics of business meetings. This includes arranging meeting rooms, presentation equipment, translation services (if required), and catering. Explore potential business networking events or industry conferences relevant to the client's field. Confirm meeting schedules and locations with the client's Chinese counterparts.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"9bec20f5-c449-4508-afd7-d841105fc7df","name":"Cultural Immersion (Key Activities/Optional)","description":"Arrange for a private guided tour of culturally significant sites in the Chinese city (e.g., Forbidden City, Great Wall of China). Suggest a traditional Chinese dinner at a renowned restaurant. Offer opportunities to experience local culture and customs respectfully. This portion of the trip is optional but is highly encouraged to foster stronger business relationships.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"d1c6aa40-52c7-42e6-b257-65fb7ca9c9c1","name":"Internal Transportation (Logistics)","description":"Book private transportation (car with driver) for all internal travel within the Chinese city to ensure punctuality and comfort for meetings and activities. If appropriate given destination, explore high-speed train options. Ensure any transfers between cities are smooth and efficient.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false}],"travelDate":"2026-07-01","finished":false},{"id":"5dd8e16c-673f-4e4b-bbfb-8951618e0707","agentId":null,"customerName":"Executive Business Trip to China - July 2026 (Advisory Review) (Advisory Review) (Advisory Review)","customerEmail":"ishan@wyzard.ai","source":"India","destination":"China","steps":[{"id":"advisory-guidance-171810123256291","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: This requires checking specific airline and hotel policies. Cancellation fees may apply. Re-routing or date changes can lead to potential fare differences. I will investigate these costs immediately based on your chosen option., Delay: A mandatory quarantine of 2 days upon arrival in China.","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Travel Agent Name] calling from [Travel Agency]. I'm calling regarding your upcoming Executive Business Trip to China scheduled for July 1st, 2026. A new travel advisory has just been issued for travel from India to China, and I need to speak with you urgently. \n\nThe advisory is classified as HIGH severity, meaning it has a significant impact on your travel plans. Specifically, it mandates a 2-day quarantine upon arrival in China for all travelers originating from India. This means you would be required to stay in a designated quarantine facility for 48 hours upon arrival before being allowed to continue your business activities. \n\nObviously, this quarantine will significantly impact your schedule. This mandatory quarantine is imposed by local authorities, and unfortunately, there are no exceptions. We understand this is frustrating news. \n\nNow, let's discuss your options. We can potentially reschedule your trip to a later date in July or even August, hoping the advisory is lifted or altered. However, there is no guarantee that will happen. Alternatively, we could look into routing your trip through a different country with no mandatory quarantine, though that may involve longer travel times and increased costs. Finally, you also have the option to cancel your trip entirely. \n\nDepending on the airline and hotel policies associated with your booking, cancelling now *might* incur cancellation fees. Changing your dates or routing could also result in higher fares due to fare differences and potentially different flight availability. I can investigate these costs for you immediately. Which option would you like me to prioritize looking into first? \n\nI understand this is a lot to take in. Please let me know if you have any questions, and I'll do my best to answer them. My priority is to help you navigate this situation and find the best possible solution for your business trip.","advisoryId":"6980df2221aa202038f77787","estimatedTimeDelay":"A mandatory quarantine of 2 days upon arrival in China.","estimatedCost":"This requires checking specific airline and hotel policies. Cancellation fees may apply. Re-routing or date changes can lead to potential fare differences. I will investigate these costs immediately based on your chosen option.","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"045967bb-a284-4fb6-8cb1-9c74555836ab","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: Dependent on chosen option. Cancellation fees typically range from $100 to $500, and fare differences can vary widely. A detailed cost breakdown will be provided after selecting an option., Delay: 5 days, if proceeding with the original plan.","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Travel Agent Name] calling from [Travel Agency Name] regarding your upcoming business trip to China on July 1st, 2026.\n\nWe've just received a high-severity travel advisory from [Authority Name] impacting travel from India to China, and it directly affects your booking. The advisory mandates a 5-day quarantine period upon arrival in China.\n\nThis means that upon arrival in China, you will be required to quarantine in a designated facility for five full days before you can proceed with your business activities. This could significantly impact your schedule and the purpose of your trip.\n\nBefore we proceed I want to let you know that your safety and well-being are my top priority. \n\nSeveral options are available to you, and I want to take the time to explore them with you to make the best decision possible. First, we could keep your itinerary as is, but factor in the 5-day quarantine period. We could look at pushing the trip back to later in July, or even August, in the hopes that the advisory will be lifted or amended. Or we could look at rerouting your trip if the China portion is not absolutely essential.\n\nPlease be aware that changing your travel dates or rerouting your trip may incur additional costs. Depending on the airline's policies and the fare class of your ticket, there may be cancellation or change fees. Rebooking for later dates could also result in higher airfares and potentially different hotel rates. I will need to investigate these costs specifically related to your booking once we decide on the best course of action.\n\nLet’s discuss your priorities for this trip. Is the timing flexible? Is the meeting location set in stone? Understanding your needs will help me find the most suitable solution. We will explore all available options, including potential waivers due to the circumstances, to minimize any financial impact.\n\nWhat would you like to do?","estimatedTimeDelay":"5 days, if proceeding with the original plan.","advisoryId":"6980ddfcf1fe6b5076e2d328","estimatedCost":"Dependent on chosen option. Cancellation fees typically range from $100 to $500, and fare differences can vary widely. A detailed cost breakdown will be provided after selecting an option.","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"ee1b06ad-aa9b-4ad9-ad69-0607ef7d4f9c","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: $500, Delay: 5 days","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Travel Agent Name] calling from [Travel Agency]. I'm calling with an urgent update regarding your upcoming business trip to China on July 1st, 2026.\n\nA new travel advisory has just been issued by [Source - e.g., health organization, government], and it's classified as HIGH severity. This advisory mandates a mandatory 5-day quarantine upon arrival in China from India. This means you will be required to isolate in a designated facility, or possibly your hotel room, for five days immediately upon arrival. \n\nI understand this will significantly impact your trip's schedule. Essentially, you'll lose five days of productive business time. The quarantine will involve strict protocols, including daily health checks, limited contact with others, and adherence to the facility’s regulations. This could influence the success of your business objectives in China. \n\nDepending on your hotel and other pre-booked arrangements, there may be costs associated with either modifying or cancelling those reservations. Similarly, changing your flight dates might incur change fees, or result in increased fare costs due to potential price fluctuations. Let me quickly check on the potential cost implications associated with these changes. (Pause to check system). Okay, I am seeing potential change fees of approximately [Estimated Fee Amount] for rescheduling the flights and [Estimated Fee Amount] for the changes to hotel and other pre-booked items, depending on the chosen new dates. These are, of course, preliminary and subject to availability.\n\nGiven the mandatory quarantine, would you consider postponing your trip by at least five days, perhaps to start your travel on or after July 6th? This would allow you to complete the quarantine period before starting your business activities. Alternatively, we could explore alternative destinations that do not currently have quarantine requirements if the timing of your trip is flexible and your business objectives can be achieved elsewhere. I will email you alternative dates and destination options with estimated price. Let me know if you have any questions or concerns.","estimatedTimeDelay":"5 days","advisoryId":"6980d91cf1fe6b5076e2d327","estimatedCost":"$500","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"71c5b011-2130-40d3-916c-aed394248a86","name":"Flights (Logistics)","description":"Book round-trip business class flights from a major Indian city (e.g., Delhi, Mumbai) to a major Chinese city (e.g., Beijing, Shanghai) with a reputable airline like Air China or China Eastern. Consider direct flights or flights with minimal layovers to optimize travel time. Specific flight options will be confirmed based on availability and preferred airport location near intended business activity.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"ca2f0012-9d0d-4c0e-8b7a-5ab3c36488b9","name":"Airport Transfers (Logistics)","description":"Arrange private airport transfers in both India (departure city) and China (arrival city) using a premium service with a chauffeur-driven car. This ensures a smooth and comfortable transition to and from the airports. Options include black car service and private car rentals. Pre-booking is essential.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"a83f3e45-a8e9-4114-9b10-7a226d7e2983","name":"Accommodation (Hotels)","description":"Reserve a luxurious suite at a 5-star hotel in the chosen Chinese city (e.g., The Peninsula Shanghai, Four Seasons Hotel Beijing). Ensure the hotel offers business amenities such as a well-equipped business center, high-speed internet, and executive lounge access. Consider the hotel's proximity to the primary business meeting locations.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"53db7d55-1df9-4a10-975f-be5018766172","name":"Visa Processing (Docs)","description":"Initiate the Chinese visa application process well in advance. Assist with document preparation, including passport validity checks, visa application forms, invitation letters (if required), and any supporting documents. Explore expedited visa processing options to ensure timely visa acquisition. We will provide a detailed checklist of necessary documents based on the most recent consulate requirements for Indian citizens traveling to China for business.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"b8b4bc7f-0ca9-4732-8a6b-8c0dfc4731fc","name":"Travel Insurance (Docs)","description":"Secure comprehensive travel insurance that covers medical emergencies, trip cancellations, lost luggage, and other unforeseen events. Ensure the insurance policy covers business-related activities and provides adequate coverage for China. The policy will need to include emergency medical evacuation. Confirm the insurance provider is reputable and accessible 24/7.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"65baaede-4cd1-480f-93b2-0b0813d94cdb","name":"Business Meeting Logistics (Key Activities)","description":"Assist with the organization and logistics of business meetings. This includes arranging meeting rooms, presentation equipment, translation services (if required), and catering. Explore potential business networking events or industry conferences relevant to the client's field. Confirm meeting schedules and locations with the client's Chinese counterparts.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"fa714920-bd3a-4c28-851a-1c59c4945f48","name":"Cultural Immersion (Key Activities/Optional)","description":"Arrange for a private guided tour of culturally significant sites in the Chinese city (e.g., Forbidden City, Great Wall of China). Suggest a traditional Chinese dinner at a renowned restaurant. Offer opportunities to experience local culture and customs respectfully. This portion of the trip is optional but is highly encouraged to foster stronger business relationships.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"371dc91a-dda9-46a1-9ca1-f5e85185c8f5","name":"Internal Transportation (Logistics)","description":"Book private transportation (car with driver) for all internal travel within the Chinese city to ensure punctuality and comfort for meetings and activities. If appropriate given destination, explore high-speed train options. Ensure any transfers between cities are smooth and efficient.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false}],"travelDate":"2026-07-01","finished":false},{"id":"f18fbe2d-48ec-4e7a-b90e-d6869d331996","agentId":null,"customerName":"Executive Business Trip to China - July 2026 (Advisory Review) (Advisory Review)","customerEmail":"ishan@wyzard.ai","source":"India","destination":"China","steps":[{"id":"advisory-guidance-171823571790499","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: $0 - $500+ (depending on booking terms, airline change fees, and fare differences), Delay: 2 days minimum (quarantine period)","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon, [Customer Name]. This is [Your Name] calling from [Travel Agency]. I'm calling regarding your upcoming business trip to China on July 1st, 2026.\n\nWe've just received a high-severity travel advisory that directly impacts your itinerary. The advisory mandates a 2-day quarantine upon arrival in China from India. This is a mandatory requirement, meaning everyone will be subject to this quarantine period upon arrival.\n\nThis quarantine will obviously impact your trip significantly. It means two days of your trip will be spent in mandatory isolation, potentially affecting your business meetings and scheduled activities. I understand this is likely very disruptive, and I sincerely apologize for the late notice.\n\nThere are a few implications we need to discuss. Firstly, the quarantine will mean a delay in your ability to fulfill your business objectives. Secondly, there is a potential cost associated with this. Depending on the terms of your booking, altering your itinerary, changing your dates, or even cancelling altogether may incur cancellation fees. Furthermore, if we reroute or postpone your trip, fares might be higher depending on availability at the time of rebooking.\n\nGiven this high-severity advisory and its implications, I strongly recommend we explore alternative options. Would you be open to postponing your trip to a later date when this advisory might be lifted, or perhaps exploring alternative locations for your business needs? We can research the likelihood of the advisory being lifted in the coming months, but I can't guarantee anything.\n\nTo give you an idea, if you were to postpone by a week, there is a possibility the advisory *could* be reviewed, but this is uncertain. I suggest we investigate pushing the trip back to August or September 2026, to give time for the situation to potentially improve.\n\nLet's discuss your priorities and see what works best for you. I’m here to help you navigate this and find the most suitable solution.\n\nDo you have any immediate questions or concerns?","advisoryId":"6980df2221aa202038f77787","estimatedTimeDelay":"2 days minimum (quarantine period)","estimatedCost":"$0 - $500+ (depending on booking terms, airline change fees, and fare differences)","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"37f3c91b-8dab-4b4e-895a-86f6b109c881","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: $0 (Until route change or cancellation is requested), Delay: 8 days (if proceeding with the original plan)","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Travel Agent Name] from [Travel Agency Name]. I'm calling regarding your upcoming business trip to China scheduled for July 1st, 2026. \n\nI need to inform you that a new Travel Advisory has been issued for travel from India to China, and it's classified as HIGH severity. This means it requires immediate attention and action. The advisory mandates a mandatory quarantine period of 8 days upon arrival in China.\n\nThis will significantly impact your trip, as you'll need to spend 8 days in quarantine before you can begin your business activities. This could affect your meeting schedules, and potentially the overall success of your trip. \n\nThere are a few options we can explore. First, we can proceed with the booking as is, understanding that you will need to undergo the mandatory 8-day quarantine. Second, we can explore postponing your trip to a later date, hoping the travel advisory changes. Third, we can explore rerouting if the business meeting can happen in another location. \n\nBe aware that postponing or rerouting may incur costs. These could include cancellation fees from airlines and hotels, as well as potential fare differences if you choose to reschedule. If you proceed as planned there will be additional costs involved with the mandatory quarantine, which we can look into upon your approval. \n\nGiven the severity of the advisory and the impact on your business trip, I strongly recommend we discuss these options in detail as soon as possible. I'm available to assist you in finding the best solution. Which option would you like to explore first?","estimatedTimeDelay":"8 days (if proceeding with the original plan)","advisoryId":"6980de44f1fe6b5076e2d329","estimatedCost":"$0 (Until route change or cancellation is requested)","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"30b39a68-fe3e-4fc4-855a-4cdde576ad6f","name":"Flights (Logistics)","description":"Book round-trip business class flights from a major Indian city (e.g., Delhi, Mumbai) to a major Chinese city (e.g., Beijing, Shanghai) with a reputable airline like Air China or China Eastern. Consider direct flights or flights with minimal layovers to optimize travel time. Specific flight options will be confirmed based on availability and preferred airport location near intended business activity.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"89320748-4210-4b4f-af68-e9bddf8af14f","name":"Airport Transfers (Logistics)","description":"Arrange private airport transfers in both India (departure city) and China (arrival city) using a premium service with a chauffeur-driven car. This ensures a smooth and comfortable transition to and from the airports. Options include black car service and private car rentals. Pre-booking is essential.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"b4dc182f-cb1a-40a3-a3e5-10d0f2955bcc","name":"Accommodation (Hotels)","description":"Reserve a luxurious suite at a 5-star hotel in the chosen Chinese city (e.g., The Peninsula Shanghai, Four Seasons Hotel Beijing). Ensure the hotel offers business amenities such as a well-equipped business center, high-speed internet, and executive lounge access. Consider the hotel's proximity to the primary business meeting locations.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"e18bdfb7-efa0-4376-85a6-3799021e698e","name":"Visa Processing (Docs)","description":"Initiate the Chinese visa application process well in advance. Assist with document preparation, including passport validity checks, visa application forms, invitation letters (if required), and any supporting documents. Explore expedited visa processing options to ensure timely visa acquisition. We will provide a detailed checklist of necessary documents based on the most recent consulate requirements for Indian citizens traveling to China for business.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"85ff8a82-b710-4a5c-8f66-4556f6a31445","name":"Travel Insurance (Docs)","description":"Secure comprehensive travel insurance that covers medical emergencies, trip cancellations, lost luggage, and other unforeseen events. Ensure the insurance policy covers business-related activities and provides adequate coverage for China. The policy will need to include emergency medical evacuation. Confirm the insurance provider is reputable and accessible 24/7.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"aa35c2d2-8518-4763-af97-79e0c11dc212","name":"Business Meeting Logistics (Key Activities)","description":"Assist with the organization and logistics of business meetings. This includes arranging meeting rooms, presentation equipment, translation services (if required), and catering. Explore potential business networking events or industry conferences relevant to the client's field. Confirm meeting schedules and locations with the client's Chinese counterparts.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"12bc04dc-cafe-44d9-842a-4817a76c8cd9","name":"Cultural Immersion (Key Activities/Optional)","description":"Arrange for a private guided tour of culturally significant sites in the Chinese city (e.g., Forbidden City, Great Wall of China). Suggest a traditional Chinese dinner at a renowned restaurant. Offer opportunities to experience local culture and customs respectfully. This portion of the trip is optional but is highly encouraged to foster stronger business relationships.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"7ca75912-82ed-4584-8cb7-3f133c9cdfbe","name":"Internal Transportation (Logistics)","description":"Book private transportation (car with driver) for all internal travel within the Chinese city to ensure punctuality and comfort for meetings and activities. If appropriate given destination, explore high-speed train options. Ensure any transfers between cities are smooth and efficient.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false}],"travelDate":"2026-07-01","finished":false},{"id":"f1f1bc22-c006-461f-ae64-b3a457f628f7","agentId":null,"customerName":"Executive Business Trip to China - July 2026 (Advisory Review) (Advisory Review) (Advisory Review)","customerEmail":"ishan@wyzard.ai","source":"India","destination":"China","steps":[{"id":"advisory-guidance-171834499257458","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: $Dependent on specific airline and hotel change/cancellation policies. Research and insert estimate during call., Delay: 2 days","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Your Name] from [Travel Agency]. I'm calling regarding your upcoming executive business trip to China scheduled for July 1st, 2026. A new travel advisory has just been issued for travel from India to China, and it requires our immediate attention. This is classified as a HIGH severity advisory, which means it significantly impacts your travel plans.\n\nThe advisory mandates a mandatory quarantine of two days upon arrival in China. This means that regardless of vaccination status or negative test results, you will be required to quarantine for 48 hours at a designated facility, likely at your own expense. \n\nThis will undoubtedly impact your business schedule and potentially necessitate adjustments to your meetings and overall itinerary. We understand this is disruptive, and we are here to help you navigate your options.\n\nHere's what we can do: \n\n*   **First and foremost, we need to discuss if the two-day quarantine is acceptable within your business objectives.** If so, we need to plan for it in your itinerary, and obtain details for your quarantine hotel. \n*   **If the quarantine is not feasible, we can explore alternative dates.** Are there any other dates in July, or even the following months, that might work better? Shifting your departure could avoid or mitigate the quarantine requirement if the advisory is lifted or revised.\n*   **We can also explore alternative destinations.** Are there any secondary choices for your business trip that could accommodate the original goals?\n\nIt's important to note that changing your booking could incur costs. Depending on the airline and hotel policies, cancellation fees, rebooking fees, or fare differences might apply. We will, of course, work to minimize these costs wherever possible.  We estimate potential rebooking fees to be in the range of [refer to reservation details for estimated cancellation/change fees].  New flights or hotels at different times may also have increased costs. Please let me know if you'd like me to explore those options now.\n\nGiven the high severity of this advisory and the potential impact on your trip, I recommend we discuss your options as soon as possible. Please let me know what time works best for you to discuss these changes in detail. We will look at alternative dates and locations immediately after our conversation.","advisoryId":"6980df2221aa202038f77787","estimatedTimeDelay":"2 days","estimatedCost":"$Dependent on specific airline and hotel change/cancellation policies. Research and insert estimate during call.","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"f4c6bfdc-ad9c-4c99-bb76-f34e82c8b481","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: $ Dependent on customer choices of changes, Delay: 8 days quarantine + flight change delay","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Your Name] from [Travel Agency Name]. I'm calling you today regarding your upcoming executive business trip to China on July 1st, 2026. We've just received a high-severity travel advisory that directly impacts your booking from India to China.\n\nThis advisory mandates a mandatory 8-day quarantine upon arrival in China. This means you will be required to isolate in a designated facility for eight days immediately after landing, which will significantly impact your ability to conduct business meetings as planned.\n\nI understand this is likely disruptive. We need to discuss your options urgently. Depending on your itinerary's flexibility, potential implications include:\n\n*   **Disruption to your schedule:** The 8-day quarantine will delay your business activities.\n*   **Potential cancellation fees:** Depending on the fare rules of your airline ticket and hotel booking, cancellations or changes may incur fees.\n*   **Possible increased costs:** Rescheduling to a different date or rerouting could result in higher airfares and hotel rates, especially booking closer to the travel date.\n\nGiven the high-severity and significant impact of this quarantine, I recommend we explore alternative travel arrangements. Are there any possibilities for shifting your travel dates? Even delaying the trip by a week or two may allow for the advisory to be updated or lifted. We can also explore rerouting to a different location, if your business requirements allow. \n\nI need to know if you'd like me to explore alternative travel dates, rerouting options, or cancellation policies. I'll need your decision promptly so we can minimize potential financial impact and ensure you have the best possible travel solution. Please let me know how you'd like to proceed.","estimatedTimeDelay":"8 days quarantine + flight change delay","advisoryId":"6980de44f1fe6b5076e2d329","estimatedCost":"$ Dependent on customer choices of changes","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"b299f9ae-18d6-4be7-815a-9d8cd4f5d513","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: $500, Delay: 5 days","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Travel Agent Name] calling from [Travel Agency]. I'm calling with an urgent update regarding your upcoming business trip to China on July 1st, 2026.\n\nA new travel advisory has just been issued by [Source - e.g., health organization, government], and it's classified as HIGH severity. This advisory mandates a mandatory 5-day quarantine upon arrival in China from India. This means you will be required to isolate in a designated facility, or possibly your hotel room, for five days immediately upon arrival. \n\nI understand this will significantly impact your trip's schedule. Essentially, you'll lose five days of productive business time. The quarantine will involve strict protocols, including daily health checks, limited contact with others, and adherence to the facility’s regulations. This could influence the success of your business objectives in China. \n\nDepending on your hotel and other pre-booked arrangements, there may be costs associated with either modifying or cancelling those reservations. Similarly, changing your flight dates might incur change fees, or result in increased fare costs due to potential price fluctuations. Let me quickly check on the potential cost implications associated with these changes. (Pause to check system). Okay, I am seeing potential change fees of approximately [Estimated Fee Amount] for rescheduling the flights and [Estimated Fee Amount] for the changes to hotel and other pre-booked items, depending on the chosen new dates. These are, of course, preliminary and subject to availability.\n\nGiven the mandatory quarantine, would you consider postponing your trip by at least five days, perhaps to start your travel on or after July 6th? This would allow you to complete the quarantine period before starting your business activities. Alternatively, we could explore alternative destinations that do not currently have quarantine requirements if the timing of your trip is flexible and your business objectives can be achieved elsewhere. I will email you alternative dates and destination options with estimated price. Let me know if you have any questions or concerns.","estimatedTimeDelay":"5 days","advisoryId":"6980d91cf1fe6b5076e2d327","estimatedCost":"$500","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"9e7e92ec-2f0e-412a-8cbf-7a31c767b13a","name":"Flights (Logistics)","description":"Book round-trip business class flights from a major Indian city (e.g., Delhi, Mumbai) to a major Chinese city (e.g., Beijing, Shanghai) with a reputable airline like Air China or China Eastern. Consider direct flights or flights with minimal layovers to optimize travel time. Specific flight options will be confirmed based on availability and preferred airport location near intended business activity.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"c4d47ac8-06b5-4a6e-b8a0-2ea31deee081","name":"Airport Transfers (Logistics)","description":"Arrange private airport transfers in both India (departure city) and China (arrival city) using a premium service with a chauffeur-driven car. This ensures a smooth and comfortable transition to and from the airports. Options include black car service and private car rentals. Pre-booking is essential.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"863773b6-013b-4dfe-bddc-24b2be77ea6d","name":"Accommodation (Hotels)","description":"Reserve a luxurious suite at a 5-star hotel in the chosen Chinese city (e.g., The Peninsula Shanghai, Four Seasons Hotel Beijing). Ensure the hotel offers business amenities such as a well-equipped business center, high-speed internet, and executive lounge access. Consider the hotel's proximity to the primary business meeting locations.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"1c7a743e-426e-4686-ac88-c6f57fbcb78d","name":"Visa Processing (Docs)","description":"Initiate the Chinese visa application process well in advance. Assist with document preparation, including passport validity checks, visa application forms, invitation letters (if required), and any supporting documents. Explore expedited visa processing options to ensure timely visa acquisition. We will provide a detailed checklist of necessary documents based on the most recent consulate requirements for Indian citizens traveling to China for business.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"2e054544-c72c-412e-9c8a-fd7379d59399","name":"Travel Insurance (Docs)","description":"Secure comprehensive travel insurance that covers medical emergencies, trip cancellations, lost luggage, and other unforeseen events. Ensure the insurance policy covers business-related activities and provides adequate coverage for China. The policy will need to include emergency medical evacuation. Confirm the insurance provider is reputable and accessible 24/7.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"5dad35fc-846e-4778-a1eb-949a907a5833","name":"Business Meeting Logistics (Key Activities)","description":"Assist with the organization and logistics of business meetings. This includes arranging meeting rooms, presentation equipment, translation services (if required), and catering. Explore potential business networking events or industry conferences relevant to the client's field. Confirm meeting schedules and locations with the client's Chinese counterparts.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"892f02f4-ffe6-4fcb-8aa3-969afb1cf1f0","name":"Cultural Immersion (Key Activities/Optional)","description":"Arrange for a private guided tour of culturally significant sites in the Chinese city (e.g., Forbidden City, Great Wall of China). Suggest a traditional Chinese dinner at a renowned restaurant. Offer opportunities to experience local culture and customs respectfully. This portion of the trip is optional but is highly encouraged to foster stronger business relationships.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"175c7cb7-75d3-426b-8bfc-653c1bf1e90f","name":"Internal Transportation (Logistics)","description":"Book private transportation (car with driver) for all internal travel within the Chinese city to ensure punctuality and comfort for meetings and activities. If appropriate given destination, explore high-speed train options. Ensure any transfers between cities are smooth and efficient.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false}],"travelDate":"2026-07-01","finished":false},{"id":"c31c0950-6bc0-4929-9eda-96655f80dfa7","agentId":null,"customerName":"Executive Business Trip to China - July 2026 (Advisory Review) (Advisory Review) (Advisory Review)","customerEmail":"ishan@wyzard.ai","source":"India","destination":"China","steps":[{"id":"advisory-guidance-171847075449041","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: Dependent on the flight and hotel, I will provide updated pricing within the next two hours, Delay: At least 2 days, depending on your willingness to reschedule","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Travel Agent Name] calling from [Travel Agency Name] regarding your upcoming business trip to China scheduled for July 1st, 2026. We have a HIGH severity travel advisory impacting your itinerary that requires your immediate attention.\n\nNew regulations have been implemented by Chinese authorities requiring a mandatory quarantine of 2 days upon arrival from India. This means that you would be required to isolate in a designated facility for 48 hours before being allowed to proceed with your planned business activities.\n\nI understand this is likely disruptive to your schedule, and I sincerely apologize for any inconvenience this may cause. We want to help you navigate this situation with minimal disruption. \n\nThe implications of this advisory include a delay of at least two days to your business itinerary. This could potentially impact planned meetings, conferences, or other commitments. Furthermore, depending on your pre-booked accommodations and transportation within China, there may be additional costs associated with rescheduling or cancellations.\n\nWe need to explore your options quickly. We can potentially look at:\n\n*   **Rescheduling your trip:** Depending on your meeting schedules, would postponing your trip by a few days or weeks be feasible? Moving the trip later *may* mean a change in airfare costs (possibly higher or lower, depending on availability) and potential changes to accommodation pricing. We would need to check availability and pricing on all your bookings if we alter the dates. \n*   **Proceeding as planned:** You can still proceed with your trip on July 1st, 2026, understanding that the first two days will be spent in mandatory quarantine. \n\nI need to look into the specific cost implications of rescheduling your flights and accommodations. This will involve checking with the airlines and hotels and understanding their cancellation and change policies. Could you please confirm whether adjusting your dates is a possibility so I can proceed with checking those costs?\n\nI will be working on this urgently and will provide you with a detailed breakdown of the estimated costs and potential alternative itineraries as soon as possible. Please expect a follow-up call/email from me within the next [Timeframe, e.g., 2 hours/by the end of the day]. In the meantime, are there any immediate questions you have for me?","advisoryId":"6980df2221aa202038f77787","estimatedTimeDelay":"At least 2 days, depending on your willingness to reschedule","estimatedCost":"Dependent on the flight and hotel, I will provide updated pricing within the next two hours","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"68afa752-038d-42df-9ed9-66addce62d0b","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: $0-Variable (Dependent on choice of rebooking, cancellation, etc. Actual costs will be provided upon investigation of specific flights and accommodation). Possible minimums for cancellation and rebooking start at $500., Delay: 8 days (due to mandatory quarantine if travel proceeds as planned). Additional time for finding new dates/routes may be required.","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Travel Agent Name] from [Travel Agency Name] calling regarding your upcoming executive business trip to China on July 1st, 2026. We've just received a high-severity travel advisory that directly impacts your booking. The advisory mandates an 8-day quarantine upon arrival in China from India.\n\nThis means that upon arrival, you will be required to isolate for 8 full days before you can begin your planned business activities. This is a mandatory requirement by the Chinese authorities, and there are no exceptions that we are aware of.\n\nI understand this is likely disruptive to your business schedule. We want to explore the options available to you to minimize any negative impact. The implications include potentially missing crucial meetings and extending your trip significantly. There may also be cancellation fees associated with your current flights and accommodations, and rebooking for alternative dates or routes could result in higher fares, particularly closer to your original travel date. Let me emphasize the quarantine is mandatory and there are no means to bypass the regulation.\n\nTo help mitigate these issues, we can explore a few options. Firstly, we could postpone your trip to a later date in July or August, hoping that the quarantine restrictions are lifted or eased by then. I will monitor the situation closely and keep you informed. Secondly, if the meeting is vital, we can explore alternative locations outside China that are accessible with fewer restrictions, though this would, of course, depend on the meeting objectives and participants' locations. Finally, we can proceed with the booking as is, acknowledging that you will need to factor in the 8-day quarantine period. However, I strongly advise against this given the potential impact on your business trip. Please let me know your thoughts. I can provide an estimate for any change or cancellation fees, as well as alternative flight and accommodation options based on your preference.","estimatedTimeDelay":"8 days (due to mandatory quarantine if travel proceeds as planned). Additional time for finding new dates/routes may be required.","advisoryId":"6980de44f1fe6b5076e2d329","estimatedCost":"$0-Variable (Dependent on choice of rebooking, cancellation, etc. Actual costs will be provided upon investigation of specific flights and accommodation). Possible minimums for cancellation and rebooking start at $500.","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"c19a9184-d25b-43ae-907a-04bd976f6fee","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: Calculating... Will advise as soon as possible once options are identified, Delay: 5 days (due to mandatory quarantine)","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Travel Agent Name] from [Travel Agency Name]. I'm calling regarding your upcoming business trip to China on July 1st, 2026.\n\nA new travel advisory has just been issued for travel from India to China, and unfortunately, it's classified as HIGH severity. This means there's a significant change impacting your travel plans. The advisory mandates a mandatory 5-day quarantine upon arrival in China.\n\nThis mandatory quarantine will significantly impact your trip. It will require you to spend 5 days in a designated quarantine facility upon arrival, which could disrupt your meeting schedule and overall itinerary. \n\nWe understand this is likely very disruptive news. We are exploring the options available to you.\n\nFirstly, completing the mandatory quarantine means your trip will be delayed by at least 5 days. Secondly, depending on your specific ticket and hotel booking conditions, there may be costs associated with changing or canceling your existing arrangements. These could include cancellation fees from the airline, hotel, or other services, as well as potential fare differences if we need to rebook flights for a later date. I will look into the specifics for your booking immediately.\n\nDepending on your schedule's flexibility, we could explore alternative dates for your travel. Moving your trip by at least 5 days later than originally planned in July might allow you to avoid needing to cut down the amount of days you would be able to conduct business in China. Do you have any flexibility in your travel dates? If not, we can explore alternative routes or destinations, though this would likely incur further changes in cost.\n\nI understand this is a lot to take in. I'm here to help you navigate this situation and find the best possible solution. Let's discuss your options and determine the best course of action. What are your thoughts?","estimatedTimeDelay":"5 days (due to mandatory quarantine)","advisoryId":"6980ddfcf1fe6b5076e2d328","estimatedCost":"Calculating... Will advise as soon as possible once options are identified","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"4395d389-dd0b-4dce-ad51-706fdb0226d5","name":"Flights (Logistics)","description":"Book round-trip business class flights from a major Indian city (e.g., Delhi, Mumbai) to a major Chinese city (e.g., Beijing, Shanghai) with a reputable airline like Air China or China Eastern. Consider direct flights or flights with minimal layovers to optimize travel time. Specific flight options will be confirmed based on availability and preferred airport location near intended business activity.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"d4de81e9-24d0-467c-94f3-3ce69a532705","name":"Airport Transfers (Logistics)","description":"Arrange private airport transfers in both India (departure city) and China (arrival city) using a premium service with a chauffeur-driven car. This ensures a smooth and comfortable transition to and from the airports. Options include black car service and private car rentals. Pre-booking is essential.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"58c95dd8-f628-4abd-9b36-7b98cc7db326","name":"Accommodation (Hotels)","description":"Reserve a luxurious suite at a 5-star hotel in the chosen Chinese city (e.g., The Peninsula Shanghai, Four Seasons Hotel Beijing). Ensure the hotel offers business amenities such as a well-equipped business center, high-speed internet, and executive lounge access. Consider the hotel's proximity to the primary business meeting locations.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"36c427cc-3354-40a3-a5ba-95fbe0816f29","name":"Visa Processing (Docs)","description":"Initiate the Chinese visa application process well in advance. Assist with document preparation, including passport validity checks, visa application forms, invitation letters (if required), and any supporting documents. Explore expedited visa processing options to ensure timely visa acquisition. We will provide a detailed checklist of necessary documents based on the most recent consulate requirements for Indian citizens traveling to China for business.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"e735069d-5c93-4977-a8d5-b17abe34f2a6","name":"Travel Insurance (Docs)","description":"Secure comprehensive travel insurance that covers medical emergencies, trip cancellations, lost luggage, and other unforeseen events. Ensure the insurance policy covers business-related activities and provides adequate coverage for China. The policy will need to include emergency medical evacuation. Confirm the insurance provider is reputable and accessible 24/7.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"71f1133f-339a-4a00-9929-b7f9596a2705","name":"Business Meeting Logistics (Key Activities)","description":"Assist with the organization and logistics of business meetings. This includes arranging meeting rooms, presentation equipment, translation services (if required), and catering. Explore potential business networking events or industry conferences relevant to the client's field. Confirm meeting schedules and locations with the client's Chinese counterparts.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"cbf6b846-be77-4d3b-9b64-cd8599ca2f7c","name":"Cultural Immersion (Key Activities/Optional)","description":"Arrange for a private guided tour of culturally significant sites in the Chinese city (e.g., Forbidden City, Great Wall of China). Suggest a traditional Chinese dinner at a renowned restaurant. Offer opportunities to experience local culture and customs respectfully. This portion of the trip is optional but is highly encouraged to foster stronger business relationships.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"2891c5b4-2bc8-4617-b8b7-c214294decce","name":"Internal Transportation (Logistics)","description":"Book private transportation (car with driver) for all internal travel within the Chinese city to ensure punctuality and comfort for meetings and activities. If appropriate given destination, explore high-speed train options. Ensure any transfers between cities are smooth and efficient.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false}],"travelDate":"2026-07-01","finished":false},{"id":"1802e2d1-8f41-4a52-bf3a-03812582e702","agentId":null,"customerName":"Executive Business Trip to China - July 2026 (Advisory Review) (Advisory Review) (Advisory Review) (Advisory Review)","customerEmail":"ishan@wyzard.ai","source":"India","destination":"China","steps":[{"id":"advisory-guidance-171863806070333","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: $200-$1000 (dependent on fare rules and availability. A detailed assessment will be provided upon request), Delay: 2 days (mandatory quarantine upon arrival in China)","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Travel Agent Name] calling from [Travel Agency]. I'm calling regarding your upcoming executive business trip to China scheduled for July 1st, 2026. A new Travel Advisory has just been issued that directly impacts your travel plans.\n\nThis is a high-severity advisory, meaning it could significantly affect your trip. The Chinese authorities are now mandating a mandatory 2-day quarantine upon arrival for all travelers from India. This means upon landing, you will be required to quarantine in a designated facility before being allowed to proceed with your business schedule.\n\nI understand this is likely disruptive, and I want to explore the best options for you. This quarantine will impact your schedule by adding two days to your trip, potentially affecting meetings and other commitments. It's also worth noting that conditions regarding quarantine requirements can change quickly.\n\nThere are a few potential solutions. We could proceed with your current booking, knowing you'll need to factor in the 2-day quarantine. Alternatively, we can look at postponing your trip to a later date, hoping the advisory is lifted by then. Shifting your departure to after [Suggest a date 2-3 months later, e.g., 'September 2026'] might give us more clarity on future travel guidelines.\n\nAnother option, depending on the flexibility of your business engagements, is to explore alternative routes or methods of conducting business to minimize the impact of the quarantine. Perhaps a virtual meeting could be a viable alternative. \n\nBefore we decide, I need to outline potential costs. Changing your flight now *could* incur cancellation fees, depending on your ticket conditions. Furthermore, rebooking for a later date is subject to availability and could potentially lead to higher fares, especially for business class tickets. I can look into this for you immediately to provide a more accurate cost estimate.\n\nWhat are your initial thoughts on this? Knowing the quarantine requirement, would you prefer to proceed with your original booking, explore alternative dates, or perhaps consider alternative arrangements for your business engagement? I'm here to help you navigate this situation and find the most suitable solution for your needs. Let's discuss the best path forward for you. Please be aware that given the high severity, it is important we make a decision relatively quickly.","advisoryId":"6980df2221aa202038f77787","estimatedTimeDelay":"2 days (mandatory quarantine upon arrival in China)","estimatedCost":"$200-$1000 (dependent on fare rules and availability. A detailed assessment will be provided upon request)","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"5d7272db-82b0-482c-a689-1fb6a6e2c8e0","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: Cancellation and rebooking costs will vary significantly depending on the airline, fare class, and hotel policies. Without knowing these details, it's impossible to provide a precise estimate. Rebooking could range from $100-$500+, while cancellation fees could range from partial refunds to no refunds depending on the booking terms and conditions. A full cost breakdown will be provided after reviewing the specific booking details., Delay: 8 days quarantine, plus potential additional delay depending on alternative date availability.","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Travel Agent Name] from [Travel Agency Name] calling regarding your upcoming executive business trip to China scheduled for July 1st, 2026. We've just received a high-severity travel advisory that I need to bring to your immediate attention.\n\nThis advisory mandates an 8-day quarantine period upon arrival in China from India. This is a mandatory requirement, impacting all travelers regardless of vaccination status or prior test results. \n\nGiven the nature of your business trip, I understand that an 8-day quarantine would likely significantly disrupt your schedule and may even render the trip unfeasible. We want to help you explore the best options for moving forward.\n\nBefore we proceed, please understand this advisory is out of our control. Changing or canceling your booking may incur costs. These might include cancellation fees from the airline and hotels, and potentially higher fares if we need to rebook flights for different dates. I will do my best to minimize these costs and find the most cost-effective alternatives.\n\nRight now, my immediate recommendation is to explore the possibility of postponing your trip to a later date when this quarantine restriction might be lifted. Are you able to provide me with some alternative dates within July, August, or September of 2026? I can check for any potential improvements in the travel advisory and availability during those periods. This would allow us to aim for a trip that meets your business objectives while avoiding the mandatory quarantine.\n\nAlternatively, if postponing isn't feasible, we can discuss options for a full cancellation, understanding that cancellation fees may apply. I will gather all relevant information on potential fees and alternative dates for you to consider before you make a decision. Could we please schedule a brief follow-up call within the next 24 hours to discuss these options in detail?\n\nThank you for your understanding, and I apologize for any inconvenience this unforeseen advisory may cause. We value your business and will do everything we can to assist you.","estimatedTimeDelay":"8 days quarantine, plus potential additional delay depending on alternative date availability.","advisoryId":"6980de44f1fe6b5076e2d329","estimatedCost":"Cancellation and rebooking costs will vary significantly depending on the airline, fare class, and hotel policies. Without knowing these details, it's impossible to provide a precise estimate. Rebooking could range from $100-$500+, while cancellation fees could range from partial refunds to no refunds depending on the booking terms and conditions. A full cost breakdown will be provided after reviewing the specific booking details.","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"75555e1e-c8b5-4c61-ae49-ac721eb29ef8","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: Dependent on chosen option. Cancellation fees typically range from $100 to $500, and fare differences can vary widely. A detailed cost breakdown will be provided after selecting an option., Delay: 5 days, if proceeding with the original plan.","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Travel Agent Name] calling from [Travel Agency Name] regarding your upcoming business trip to China on July 1st, 2026.\n\nWe've just received a high-severity travel advisory from [Authority Name] impacting travel from India to China, and it directly affects your booking. The advisory mandates a 5-day quarantine period upon arrival in China.\n\nThis means that upon arrival in China, you will be required to quarantine in a designated facility for five full days before you can proceed with your business activities. This could significantly impact your schedule and the purpose of your trip.\n\nBefore we proceed I want to let you know that your safety and well-being are my top priority. \n\nSeveral options are available to you, and I want to take the time to explore them with you to make the best decision possible. First, we could keep your itinerary as is, but factor in the 5-day quarantine period. We could look at pushing the trip back to later in July, or even August, in the hopes that the advisory will be lifted or amended. Or we could look at rerouting your trip if the China portion is not absolutely essential.\n\nPlease be aware that changing your travel dates or rerouting your trip may incur additional costs. Depending on the airline's policies and the fare class of your ticket, there may be cancellation or change fees. Rebooking for later dates could also result in higher airfares and potentially different hotel rates. I will need to investigate these costs specifically related to your booking once we decide on the best course of action.\n\nLet’s discuss your priorities for this trip. Is the timing flexible? Is the meeting location set in stone? Understanding your needs will help me find the most suitable solution. We will explore all available options, including potential waivers due to the circumstances, to minimize any financial impact.\n\nWhat would you like to do?","estimatedTimeDelay":"5 days, if proceeding with the original plan.","advisoryId":"6980ddfcf1fe6b5076e2d328","estimatedCost":"Dependent on chosen option. Cancellation fees typically range from $100 to $500, and fare differences can vary widely. A detailed cost breakdown will be provided after selecting an option.","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"b7fb9530-475e-457f-a379-735eb78f9f68","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: $500, Delay: 5 days","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Travel Agent Name] calling from [Travel Agency]. I'm calling with an urgent update regarding your upcoming business trip to China on July 1st, 2026.\n\nA new travel advisory has just been issued by [Source - e.g., health organization, government], and it's classified as HIGH severity. This advisory mandates a mandatory 5-day quarantine upon arrival in China from India. This means you will be required to isolate in a designated facility, or possibly your hotel room, for five days immediately upon arrival. \n\nI understand this will significantly impact your trip's schedule. Essentially, you'll lose five days of productive business time. The quarantine will involve strict protocols, including daily health checks, limited contact with others, and adherence to the facility’s regulations. This could influence the success of your business objectives in China. \n\nDepending on your hotel and other pre-booked arrangements, there may be costs associated with either modifying or cancelling those reservations. Similarly, changing your flight dates might incur change fees, or result in increased fare costs due to potential price fluctuations. Let me quickly check on the potential cost implications associated with these changes. (Pause to check system). Okay, I am seeing potential change fees of approximately [Estimated Fee Amount] for rescheduling the flights and [Estimated Fee Amount] for the changes to hotel and other pre-booked items, depending on the chosen new dates. These are, of course, preliminary and subject to availability.\n\nGiven the mandatory quarantine, would you consider postponing your trip by at least five days, perhaps to start your travel on or after July 6th? This would allow you to complete the quarantine period before starting your business activities. Alternatively, we could explore alternative destinations that do not currently have quarantine requirements if the timing of your trip is flexible and your business objectives can be achieved elsewhere. I will email you alternative dates and destination options with estimated price. Let me know if you have any questions or concerns.","estimatedTimeDelay":"5 days","advisoryId":"6980d91cf1fe6b5076e2d327","estimatedCost":"$500","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"80154904-35a1-45cc-b23c-ca89ec3c1f05","name":"Flights (Logistics)","description":"Book round-trip business class flights from a major Indian city (e.g., Delhi, Mumbai) to a major Chinese city (e.g., Beijing, Shanghai) with a reputable airline like Air China or China Eastern. Consider direct flights or flights with minimal layovers to optimize travel time. Specific flight options will be confirmed based on availability and preferred airport location near intended business activity.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"06e01f11-94a8-4c09-a2e2-25a3d336ee4b","name":"Airport Transfers (Logistics)","description":"Arrange private airport transfers in both India (departure city) and China (arrival city) using a premium service with a chauffeur-driven car. This ensures a smooth and comfortable transition to and from the airports. Options include black car service and private car rentals. Pre-booking is essential.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"bcbaf4c0-51ab-4ab7-9df4-609e85bd3662","name":"Accommodation (Hotels)","description":"Reserve a luxurious suite at a 5-star hotel in the chosen Chinese city (e.g., The Peninsula Shanghai, Four Seasons Hotel Beijing). Ensure the hotel offers business amenities such as a well-equipped business center, high-speed internet, and executive lounge access. Consider the hotel's proximity to the primary business meeting locations.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"5ed3d609-8bb7-4a04-bfb7-ac99bbbea113","name":"Visa Processing (Docs)","description":"Initiate the Chinese visa application process well in advance. Assist with document preparation, including passport validity checks, visa application forms, invitation letters (if required), and any supporting documents. Explore expedited visa processing options to ensure timely visa acquisition. We will provide a detailed checklist of necessary documents based on the most recent consulate requirements for Indian citizens traveling to China for business.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"7eac6e7a-f4d6-4563-b994-70ec720519db","name":"Travel Insurance (Docs)","description":"Secure comprehensive travel insurance that covers medical emergencies, trip cancellations, lost luggage, and other unforeseen events. Ensure the insurance policy covers business-related activities and provides adequate coverage for China. The policy will need to include emergency medical evacuation. Confirm the insurance provider is reputable and accessible 24/7.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"dcb60004-0da3-445f-9cc7-e26db4c5eca4","name":"Business Meeting Logistics (Key Activities)","description":"Assist with the organization and logistics of business meetings. This includes arranging meeting rooms, presentation equipment, translation services (if required), and catering. Explore potential business networking events or industry conferences relevant to the client's field. Confirm meeting schedules and locations with the client's Chinese counterparts.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"3c4ee3f1-3ef6-41d6-95bb-1df0c3b94be5","name":"Cultural Immersion (Key Activities/Optional)","description":"Arrange for a private guided tour of culturally significant sites in the Chinese city (e.g., Forbidden City, Great Wall of China). Suggest a traditional Chinese dinner at a renowned restaurant. Offer opportunities to experience local culture and customs respectfully. This portion of the trip is optional but is highly encouraged to foster stronger business relationships.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"a391ff4a-5ff7-4c61-b063-017cf49f8bad","name":"Internal Transportation (Logistics)","description":"Book private transportation (car with driver) for all internal travel within the Chinese city to ensure punctuality and comfort for meetings and activities. If appropriate given destination, explore high-speed train options. Ensure any transfers between cities are smooth and efficient.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false}],"travelDate":"2026-07-01","finished":false},{"id":"cf9be28d-0d88-411f-a615-7eb35c8b80e6","agentId":null,"customerName":"Executive Business Trip to China - July 2026 (Advisory Review) (Advisory Review)","customerEmail":"ishan@wyzard.ai","source":"India","destination":"China","steps":[{"id":"advisory-guidance-171873655495833","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: Dependent on airline change fee policies and accommodation flexibility. Could range from $0 (if flexible) to $500+ if significant changes are needed., Delay: 2 days","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Your Name] from [Travel Agency Name]. I'm calling you today regarding your upcoming executive business trip to China scheduled for July 1st, 2026. A new travel advisory has just been issued for travel from India to China that requires immediate attention. The advisory is rated as HIGH severity, meaning it significantly impacts your travel plans. \n\nSpecifically, this advisory mandates a mandatory 2-day quarantine upon arrival in China. This means you'll need to spend the first two days of your trip isolated, which may impact your business schedule significantly. We understand this is likely disruptive, and we're here to help you navigate this situation. \n\nThis quarantine could lead to a few potential issues. Firstly, it impacts the duration of your trip and any pre-scheduled meetings. Secondly, depending on the flexibility of your tickets and accommodation, there might be cancellation fees or costs associated with changing your itinerary. Additionally, if we need to rebook flights for a later date, fares could be higher than what you originally paid. We will work hard to minimize these costs, but it's important to be aware of them.\n\nGiven the mandatory quarantine, I recommend exploring a few options. The most straightforward would be to postpone your trip by at least two days, allowing you to fulfill the quarantine requirement before commencing your business activities. Alternatively, depending on the nature of your business, we could explore whether a remote work solution is possible for the initial two days. Or, if the trip is time-sensitive and cannot be delayed, we could look at alternative destinations that would meet your business objectives without the quarantine requirement, although I understand that this is probably not feasible. \n\nI'm ready to discuss these options in more detail and find the best solution for you. Could you spare some time now to discuss your preferred course of action, or would you prefer I call you back at a more convenient time?","advisoryId":"6980df2221aa202038f77787","estimatedTimeDelay":"2 days","estimatedCost":"Dependent on airline change fee policies and accommodation flexibility. Could range from $0 (if flexible) to $500+ if significant changes are needed.","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"4a0c8fdc-fa06-4a1b-b959-2585be5dacbc","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: $0 (depending on the customer's decision on whether or not to re-book), Delay: 2 days","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Travel Agent Name] from [Travel Agency]. I'm calling you regarding your upcoming business trip to China on July 1st, 2026.\n\nI'm afraid I have some urgent news. A new travel advisory has just been issued for travel from India to China, and it’s classified as HIGH severity. This means there are significant implications for your trip.\n\nSpecifically, the advisory mandates a mandatory quarantine period of 2 days upon arrival in China. This means that upon landing, you will be required to stay at a designated facility for 48 hours before you are allowed to continue your travels. \n\nI understand this is likely disruptive, especially given the nature of a business trip. This quarantine will impact your schedule and potentially affect meeting timelines. We need to discuss your options as soon as possible.\n\nBefore we proceed, please note that any changes to your booking, depending on the fare class and airline policies, might incur cancellation or change fees. Also, rebooking for a different date could potentially result in higher fares depending on availability. Let me check on that. I can explore possible options for you now. Would you like me to look into potential options to move your trip? For example, can we discuss moving your travel date back a few days to allow more flexibility or potentially adjusting your itinerary to minimize disruption? Or are you planning on taking the trip anyway?\n\nI will do my best to find the most cost-effective and convenient solution for you. Please let me know your preference so that I can start assisting you.","estimatedTimeDelay":"2 days","advisoryId":"6980deaaf1fe6b5076e2d32a","estimatedCost":"$0 (depending on the customer's decision on whether or not to re-book)","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"af37e900-122a-4329-9140-204fce205d4f","name":"Flights (Logistics)","description":"Book round-trip business class flights from a major Indian city (e.g., Delhi, Mumbai) to a major Chinese city (e.g., Beijing, Shanghai) with a reputable airline like Air China or China Eastern. Consider direct flights or flights with minimal layovers to optimize travel time. Specific flight options will be confirmed based on availability and preferred airport location near intended business activity.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"b2bae713-ee6a-4368-91ad-f73cc0432659","name":"Airport Transfers (Logistics)","description":"Arrange private airport transfers in both India (departure city) and China (arrival city) using a premium service with a chauffeur-driven car. This ensures a smooth and comfortable transition to and from the airports. Options include black car service and private car rentals. Pre-booking is essential.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"92409288-bb8e-42d9-9fc3-055a6e7c6969","name":"Accommodation (Hotels)","description":"Reserve a luxurious suite at a 5-star hotel in the chosen Chinese city (e.g., The Peninsula Shanghai, Four Seasons Hotel Beijing). Ensure the hotel offers business amenities such as a well-equipped business center, high-speed internet, and executive lounge access. Consider the hotel's proximity to the primary business meeting locations.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"34ee8fb0-5efc-434e-a7c0-f745f9a632f3","name":"Visa Processing (Docs)","description":"Initiate the Chinese visa application process well in advance. Assist with document preparation, including passport validity checks, visa application forms, invitation letters (if required), and any supporting documents. Explore expedited visa processing options to ensure timely visa acquisition. We will provide a detailed checklist of necessary documents based on the most recent consulate requirements for Indian citizens traveling to China for business.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"8f2ef2b9-80ae-40cb-bc6d-563f47e675eb","name":"Travel Insurance (Docs)","description":"Secure comprehensive travel insurance that covers medical emergencies, trip cancellations, lost luggage, and other unforeseen events. Ensure the insurance policy covers business-related activities and provides adequate coverage for China. The policy will need to include emergency medical evacuation. Confirm the insurance provider is reputable and accessible 24/7.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"edc3891c-7ad0-40bb-b7e1-2973157535f3","name":"Business Meeting Logistics (Key Activities)","description":"Assist with the organization and logistics of business meetings. This includes arranging meeting rooms, presentation equipment, translation services (if required), and catering. Explore potential business networking events or industry conferences relevant to the client's field. Confirm meeting schedules and locations with the client's Chinese counterparts.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"35f501da-9d6c-4b89-95db-b0c2f8c59085","name":"Cultural Immersion (Key Activities/Optional)","description":"Arrange for a private guided tour of culturally significant sites in the Chinese city (e.g., Forbidden City, Great Wall of China). Suggest a traditional Chinese dinner at a renowned restaurant. Offer opportunities to experience local culture and customs respectfully. This portion of the trip is optional but is highly encouraged to foster stronger business relationships.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"be1858d9-7042-462b-830e-74804a7e287e","name":"Internal Transportation (Logistics)","description":"Book private transportation (car with driver) for all internal travel within the Chinese city to ensure punctuality and comfort for meetings and activities. If appropriate given destination, explore high-speed train options. Ensure any transfers between cities are smooth and efficient.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false}],"travelDate":"2026-07-01","finished":false},{"id":"e57ec888-b5f4-4687-a8c3-02ecc614c924","agentId":null,"customerName":"Executive Business Trip to China - July 2026 (Advisory Review) (Advisory Review) (Advisory Review)","customerEmail":"ishan@wyzard.ai","source":"India","destination":"China","steps":[{"id":"advisory-guidance-171882061963083","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: Costs will vary greatly depending on chosen option and specific booking details.  A detailed cost breakdown will be provided once an option is selected for further investigation. This will include any airline change fees (estimated $100-$500), hotel cancellation fees (variable), and potential fare differences., Delay: 2 days minimum for quarantine if trip proceeds as planned. Additional delays possible due to flight availability and rebooking processes if trip is postponed.","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Travel Agent Name] calling from [Travel Agency Name] regarding your upcoming business trip to China scheduled for July 1st, 2026.  I'm calling with some urgent information regarding a new travel advisory. \n\nA *high severity* advisory has just been issued for travel from India to China. This advisory mandates a mandatory 2-day quarantine upon arrival in China. This means that regardless of your vaccination status or recent COVID tests, you will be required to isolate in a designated facility or hotel for 48 hours. \n\nThis quarantine will undoubtedly impact your itinerary and the purpose of your business trip. We understand this is very disruptive, especially given the executive nature of your travel. \n\nLet's discuss your options.  Firstly, continuing with your current booking means factoring in the 2-day quarantine.  \n\nSecondly, we could explore postponing your trip.  Given the high severity of the advisory and the inflexible nature of mandatory quarantines, this might be the most practical option. If postponing, we would need to look at availability and potentially face fare differences. We will do our best to minimize any additional costs.  \n\nThirdly, depending on the nature of your business in China, we could explore alternative ways to meet your objectives without physical travel, like virtual meetings. While not ideal, it is an option to consider.\n\nBefore making any decisions, I'd like to discuss the potential costs associated with each option.  Cancellation fees may apply depending on the specific terms and conditions of your flights and accommodation. Rebooking for a later date could also incur higher fares, as prices fluctuate. We’ll need to investigate these fees on a case-by-case basis.\n\nTo reiterate, the 2-day mandatory quarantine *will* significantly impact your trip. Please let me know how you'd like to proceed. We are here to help you navigate these changes and find the best possible solution for your business needs.","advisoryId":"6980df2221aa202038f77787","estimatedTimeDelay":"2 days minimum for quarantine if trip proceeds as planned. Additional delays possible due to flight availability and rebooking processes if trip is postponed.","estimatedCost":"Costs will vary greatly depending on chosen option and specific booking details.  A detailed cost breakdown will be provided once an option is selected for further investigation. This will include any airline change fees (estimated $100-$500), hotel cancellation fees (variable), and potential fare differences.","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"94f7c637-109f-472b-8ad5-32357d95909d","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: $0-500 (This is a broad estimate. Actual cost will vary greatly depending on fare class, airline, hotel, and time of booking change. A detailed cost breakdown will be provided upon exploring specific options.), Delay: 2 days (minimum, due to quarantine). Additional delays may occur due to rescheduling flight availability.","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon, [Customer Name]. This is [Travel Agent Name] from [Travel Agency Name] regarding your upcoming business trip to China on July 1st, 2026. I'm calling you with some urgent news regarding a newly issued travel advisory that significantly impacts your travel plans.\n\nA HIGH severity advisory has been issued for travel between India and China. This advisory mandates a mandatory 2-day quarantine upon arrival in China. I understand this is likely to significantly disrupt your business schedule.\n\nThis mandatory quarantine will affect your itinerary. You will need to factor in these 2 days for quarantine upon arrival. This may impact any meetings or events planned for the first two days of your trip.\n\nThere are several options we can explore. Firstly, we can proceed with the original booking, understanding that you will need to comply with the quarantine requirements. Secondly, we can explore alternative travel dates, potentially pushing your trip back to allow more buffer time, or, if possible, moving it forward if the quarantine regulations are expected to change (though there's no guarantee of that). Finally, we could consider rerouting, although given the nature of your business trip, that may not be feasible. The cost of rerouting to another location may include penalties or cancellation fees depending on the airline and hotels. Delaying the trip could mean increased airline and hotel costs, especially given the fluctuating nature of travel fares. We will review the cost impact before confirming any changes.\n\nCould you please provide a short overview of how critical the first two days of your trip are, so that we can find the best available option for you?","estimatedTimeDelay":"2 days (minimum, due to quarantine). Additional delays may occur due to rescheduling flight availability.","advisoryId":"6980deaaf1fe6b5076e2d32a","estimatedCost":"$0-500 (This is a broad estimate. Actual cost will vary greatly depending on fare class, airline, hotel, and time of booking change. A detailed cost breakdown will be provided upon exploring specific options.)","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"83da7179-4f21-4780-83b1-9e6e587cecc4","name":"Advisory Impact Review","description":"Review new advisory execution with customer. Estimated Cost: $500, Delay: 5 days","status":"PENDING","metadata":{"agentScript":"Good morning/afternoon [Customer Name], this is [Travel Agent Name] calling from [Travel Agency]. I'm calling with an urgent update regarding your upcoming business trip to China on July 1st, 2026.\n\nA new travel advisory has just been issued by [Source - e.g., health organization, government], and it's classified as HIGH severity. This advisory mandates a mandatory 5-day quarantine upon arrival in China from India. This means you will be required to isolate in a designated facility, or possibly your hotel room, for five days immediately upon arrival. \n\nI understand this will significantly impact your trip's schedule. Essentially, you'll lose five days of productive business time. The quarantine will involve strict protocols, including daily health checks, limited contact with others, and adherence to the facility’s regulations. This could influence the success of your business objectives in China. \n\nDepending on your hotel and other pre-booked arrangements, there may be costs associated with either modifying or cancelling those reservations. Similarly, changing your flight dates might incur change fees, or result in increased fare costs due to potential price fluctuations. Let me quickly check on the potential cost implications associated with these changes. (Pause to check system). Okay, I am seeing potential change fees of approximately [Estimated Fee Amount] for rescheduling the flights and [Estimated Fee Amount] for the changes to hotel and other pre-booked items, depending on the chosen new dates. These are, of course, preliminary and subject to availability.\n\nGiven the mandatory quarantine, would you consider postponing your trip by at least five days, perhaps to start your travel on or after July 6th? This would allow you to complete the quarantine period before starting your business activities. Alternatively, we could explore alternative destinations that do not currently have quarantine requirements if the timing of your trip is flexible and your business objectives can be achieved elsewhere. I will email you alternative dates and destination options with estimated price. Let me know if you have any questions or concerns.","estimatedTimeDelay":"5 days","advisoryId":"6980d91cf1fe6b5076e2d327","estimatedCost":"$500","isAdvisoryTask":true},"warning":null,"alternative":null,"completed":false},{"id":"94011fe2-3060-44fa-a3ae-6bb06de76ccb","name":"Flights (Logistics)","description":"Book round-trip business class flights from a major Indian city (e.g., Delhi, Mumbai) to a major Chinese city (e.g., Beijing, Shanghai) with a reputable airline like Air China or China Eastern. Consider direct flights or flights with minimal layovers to optimize travel time. Specific flight options will be confirmed based on availability and preferred airport location near intended business activity.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"d02b6589-40ad-4265-9294-2da38cf30697","name":"Airport Transfers (Logistics)","description":"Arrange private airport transfers in both India (departure city) and China (arrival city) using a premium service with a chauffeur-driven car. This ensures a smooth and comfortable transition to and from the airports. Options include black car service and private car rentals. Pre-booking is essential.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"a5147da2-6b7d-45c6-bffa-d3692945a548","name":"Accommodation (Hotels)","description":"Reserve a luxurious suite at a 5-star hotel in the chosen Chinese city (e.g., The Peninsula Shanghai, Four Seasons Hotel Beijing). Ensure the hotel offers business amenities such as a well-equipped business center, high-speed internet, and executive lounge access. Consider the hotel's proximity to the primary business meeting locations.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"acac2c93-d4dc-4a9e-bcf5-3bb975cc7458","name":"Visa Processing (Docs)","description":"Initiate the Chinese visa application process well in advance. Assist with document preparation, including passport validity checks, visa application forms, invitation letters (if required), and any supporting documents. Explore expedited visa processing options to ensure timely visa acquisition. We will provide a detailed checklist of necessary documents based on the most recent consulate requirements for Indian citizens traveling to China for business.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"0c8563bf-12a5-4777-93f4-4d6695dc901f","name":"Travel Insurance (Docs)","description":"Secure comprehensive travel insurance that covers medical emergencies, trip cancellations, lost luggage, and other unforeseen events. Ensure the insurance policy covers business-related activities and provides adequate coverage for China. The policy will need to include emergency medical evacuation. Confirm the insurance provider is reputable and accessible 24/7.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"91b83d4d-a49b-46de-af7e-26332a3369a7","name":"Business Meeting Logistics (Key Activities)","description":"Assist with the organization and logistics of business meetings. This includes arranging meeting rooms, presentation equipment, translation services (if required), and catering. Explore potential business networking events or industry conferences relevant to the client's field. Confirm meeting schedules and locations with the client's Chinese counterparts.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"ccfd7be0-2a66-4489-b82f-03c8ccec2072","name":"Cultural Immersion (Key Activities/Optional)","description":"Arrange for a private guided tour of culturally significant sites in the Chinese city (e.g., Forbidden City, Great Wall of China). Suggest a traditional Chinese dinner at a renowned restaurant. Offer opportunities to experience local culture and customs respectfully. This portion of the trip is optional but is highly encouraged to foster stronger business relationships.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false},{"id":"770923c9-de6b-4a84-aa47-b42368ec9bd7","name":"Internal Transportation (Logistics)","description":"Book private transportation (car with driver) for all internal travel within the Chinese city to ensure punctuality and comfort for meetings and activities. If appropriate given destination, explore high-speed train options. Ensure any transfers between cities are smooth and efficient.","status":"PENDING","metadata":{},"warning":null,"alternative":null,"completed":false}],"travelDate":"2026-07-01","finished":false}]